dldavis007/dg128_gcc_motion/Embedded/Include/mc9s12dg128_imagecraft_reference.h
/* mc9s12dg128.h
** Copyright (C) 2005 ImageCraft Creations Inc. 
** V1.0 Created November, 3 2005
*/
 
#ifndef __mc9s12dg128_H
#define __mc9s12dg128_H


/*  bit masks
 */
#define       BIT0	0x1
#define       BIT1	0x2
#define       BIT2	0x4
#define       BIT3	0x8
#define       BIT4	0x10
#define       BIT5	0x20
#define       BIT6	0x40
#define       BIT7	0x80




#define REG_BASE  	0x0000
#define VReserved63	0x0000FF80
#define VReserved62	0x0000FF82
#define VReserved61	0x0000FF84
#define VReserved60	0x0000FF86
#define VReserved59	0x0000FF88
#define VReserved58	0x0000FF8A
#define Vpwmesdn  	0x0000FF8C
#define Vportp    	0x0000FF8E
#define Vcan4tx   	0x0000FF90
#define Vcan4rx   	0x0000FF92
#define Vcan4err  	0x0000FF94
#define Vcan4wkup 	0x0000FF96
#define VReserved51	0x0000FF98
#define VReserved50	0x0000FF9A
#define VReserved49	0x0000FF9C
#define VReserved48	0x0000FF9E
#define VReserved47	0x0000FFA0
#define VReserved46	0x0000FFA2
#define VReserved45	0x0000FFA4
#define VReserved44	0x0000FFA6
#define VReserved43	0x0000FFA8
#define VReserved42	0x0000FFAA
#define VReserved41	0x0000FFAC
#define VReserved40	0x0000FFAE
#define Vcan0tx   	0x0000FFB0
#define Vcan0rx   	0x0000FFB2
#define Vcan0err  	0x0000FFB4
#define Vcan0wkup 	0x0000FFB6
#define Vflash    	0x0000FFB8
#define Veeprom   	0x0000FFBA
#define VReserved33	0x0000FFBC
#define Vspi1     	0x0000FFBE
#define Viic      	0x0000FFC0
#define VReserved30	0x0000FFC2
#define Vcrgscm   	0x0000FFC4
#define Vcrgplllck	0x0000FFC6
#define Vtimpabovf	0x0000FFC8
#define Vtimmdcu  	0x0000FFCA
#define Vporth    	0x0000FFCC
#define Vportj    	0x0000FFCE
#define Vatd1     	0x0000FFD0
#define Vatd0     	0x0000FFD2
#define Vsci1     	0x0000FFD4
#define Vsci0     	0x0000FFD6
#define Vspi0     	0x0000FFD8
#define Vtimpaie  	0x0000FFDA
#define Vtimpaaovf	0x0000FFDC
#define Vtimovf   	0x0000FFDE
#define Vtimch7   	0x0000FFE0
#define Vtimch6   	0x0000FFE2
#define Vtimch5   	0x0000FFE4
#define Vtimch4   	0x0000FFE6
#define Vtimch3   	0x0000FFE8
#define Vtimch2   	0x0000FFEA
#define Vtimch1   	0x0000FFEC
#define Vtimch0   	0x0000FFEE
#define Vrti      	0x0000FFF0
#define Virq      	0x0000FFF2
#define Vxirq     	0x0000FFF4
#define Vswi      	0x0000FFF6
#define Vtrap     	0x0000FFF8
#define Vcop      	0x0000FFFA
#define Vclkmon   	0x0000FFFC
#define Vreset    	0x0000FFFE

#define PORTAB	(*(volatile unsigned *)(REG_BASE + 0x00000000))
#define DDRAB	(*(volatile unsigned *)(REG_BASE + 0x00000002))
#define PORTA	(*(volatile unsigned char *)(REG_BASE + 0x00000000))
#define PORTB	(*(volatile unsigned char *)(REG_BASE + 0x00000001))
#define DDRA	(*(volatile unsigned char *)(REG_BASE + 0x00000002))
#define DDRB	(*(volatile unsigned char *)(REG_BASE + 0x00000003))
#define PORTE	(*(volatile unsigned char *)(REG_BASE + 0x00000008))
#define DDRE	(*(volatile unsigned char *)(REG_BASE + 0x00000009))
#define PEAR	(*(volatile unsigned char *)(REG_BASE + 0x0000000A))

#define RDWE      	0x4
#define LSTRE     	0x8
#define NECLK     	0x10
#define PIPOE     	0x20
#define NOACCE    	0x80

#define MODE	(*(volatile unsigned char *)(REG_BASE + 0x0000000B))

#define EME       	0x1
#define EMK       	0x2
#define IVIS      	0x8
#define MODA      	0x20
#define MODB      	0x40
#define MODC      	0x80
#define MOD       	0xe0

#define PUCR	(*(volatile unsigned char *)(REG_BASE + 0x0000000C))

#define PUPAE     	0x1
#define PUPBE     	0x2
#define PUPEE     	0x10
#define PUPKE     	0x80

#define RDRIV	(*(volatile unsigned char *)(REG_BASE + 0x0000000D))

#define RDPA      	0x1
#define RDPB      	0x2
#define RDPE      	0x10
#define RDPK      	0x80
#define RDPx      	0x3

#define EBICTL	(*(volatile unsigned char *)(REG_BASE + 0x0000000E))

#define ESTR      	0x1

#define INITRM	(*(volatile unsigned char *)(REG_BASE + 0x00000010))

#define RAMHAL    	0x1
#define RAM11     	0x8
#define RAM12     	0x10
#define RAM13     	0x20
#define RAM14     	0x40
#define RAM15     	0x80
#define RAM_11    	0xf8

#define INITRG	(*(volatile unsigned char *)(REG_BASE + 0x00000011))

#define REG11     	0x8
#define REG12     	0x10
#define REG13     	0x20
#define REG14     	0x40
#define REG_11    	0x78

#define INITEE	(*(volatile unsigned char *)(REG_BASE + 0x00000012))

#define EEON      	0x1
#define EE12      	0x10
#define EE13      	0x20
#define EE14      	0x40
#define EE15      	0x80
#define EE_12     	0xf0

#define MISC	(*(volatile unsigned char *)(REG_BASE + 0x00000013))

#define ROMON     	0x1
#define ROMHM     	0x2
#define EXSTR0    	0x4
#define EXSTR1    	0x8
#define EXSTR     	0xc

#define MTST0	(*(volatile unsigned char *)(REG_BASE + 0x00000014))
#define ITCR	(*(volatile unsigned char *)(REG_BASE + 0x00000015))

#define ADR0      	0x1
#define ADR1      	0x2
#define ADR2      	0x4
#define ADR3      	0x8
#define WRTINT    	0x10
#define ADR       	0xf

#define ITEST	(*(volatile unsigned char *)(REG_BASE + 0x00000016))

#define INT0      	0x1
#define INT2      	0x2
#define INT4      	0x4
#define INT6      	0x8
#define INT8      	0x10
#define INTA      	0x20
#define INTC      	0x40
#define INTE      	0x80

#define MTST1	(*(volatile unsigned char *)(REG_BASE + 0x00000017))
#define PARTIDH	(*(volatile unsigned char *)(REG_BASE + 0x0000001A))

#define ID15      	0x1
#define ID14      	0x2
#define ID13      	0x4
#define ID12      	0x8
#define ID11      	0x10
#define ID10      	0x20
#define ID9       	0x40
#define ID8       	0x80

#define PARTIDL	(*(volatile unsigned char *)(REG_BASE + 0x0000001B))

#define ID0       	0x1
#define ID1       	0x2
#define ID2       	0x4
#define ID3       	0x8
#define ID4       	0x10
#define ID5       	0x20
#define ID6       	0x40
#define ID7       	0x80
//#define ID        	0xff

#define MEMSIZ0	(*(volatile unsigned char *)(REG_BASE + 0x0000001C))

#define sw0       	0x1
#define sw1       	0x2
#define sw2       	0x4

/* duplicate resolved by name mangling -- prepend MEMSIZ0_eep */
#define MEMSIZ0_eep_sw0	0x10

/* duplicate resolved by name mangling -- prepend MEMSIZ0_eep */
#define MEMSIZ0_eep_sw1	0x20

/* duplicate resolved by name mangling -- prepend MEMSIZ0_reg */
#define MEMSIZ0_reg_sw0	0x80
#define sw        	0x7

/* duplicate resolved by name mangling -- prepend MEMSIZ0_eep */
#define MEMSIZ0_eep_sw	0x30

#define MEMSIZ1	(*(volatile unsigned char *)(REG_BASE + 0x0000001D))

/* duplicate resolved by name mangling -- prepend MEMSIZ1_pag */

#define MEMSIZ1_pag_sw0	0x1

/* duplicate resolved by name mangling -- prepend MEMSIZ1_pag */
#define MEMSIZ1_pag_sw1	0x2

/* duplicate resolved by name mangling -- prepend MEMSIZ1_rom */
#define MEMSIZ1_rom_sw0	0x40

/* duplicate resolved by name mangling -- prepend MEMSIZ1_rom */
#define MEMSIZ1_rom_sw1	0x80

/* duplicate resolved by name mangling -- prepend MEMSIZ1_pag */
#define MEMSIZ1_pag_sw	0x3

/* duplicate resolved by name mangling -- prepend MEMSIZ1_rom */
#define MEMSIZ1_rom_sw	0xc0

#define INTCR	(*(volatile unsigned char *)(REG_BASE + 0x0000001E))

#define IRQEN     	0x40
#define IRQE      	0x80

