dldavis007/dg128_gcc_motion/Embedded/Include/mc9s12dg128_imagecraft_reference.h
#define HPRIO	(*(volatile unsigned char *)(REG_BASE + 0x0000001F))

#define PSEL1     	0x2
#define PSEL2     	0x4
#define PSEL3     	0x8
#define PSEL4     	0x10
#define PSEL5     	0x20
#define PSEL6     	0x40
#define PSEL7     	0x80
#define PSEL_1    	0xfe

#define BKPCT0	(*(volatile unsigned char *)(REG_BASE + 0x00000028))

#define BKTAG     	0x10
#define BKBDM     	0x20
#define BKFULL    	0x40
#define BKEN      	0x80

#define BKPCT1	(*(volatile unsigned char *)(REG_BASE + 0x00000029))

#define BK1RW     	0x1
#define BK1RWE    	0x2
#define BK0RW     	0x4
#define BK0RWE    	0x8
#define BK1MBL    	0x10
#define BK1MBH    	0x20
#define BK0MBL    	0x40
#define BK0MBH    	0x80

#define BKP0X	(*(volatile unsigned char *)(REG_BASE + 0x0000002A))

#define BK0V0     	0x1
#define BK0V1     	0x2
#define BK0V2     	0x4
#define BK0V3     	0x8
#define BK0V4     	0x10
#define BK0V5     	0x20
#define BK0V      	0x3f

#define BKP0H	(*(volatile unsigned char *)(REG_BASE + 0x0000002B))
#define BKP0L	(*(volatile unsigned char *)(REG_BASE + 0x0000002C))
#define BKP1X	(*(volatile unsigned char *)(REG_BASE + 0x0000002D))

#define BK1V0     	0x1
#define BK1V1     	0x2
#define BK1V2     	0x4
#define BK1V3     	0x8
#define BK1V4     	0x10
#define BK1V5     	0x20
#define BK1V      	0x3f

#define BKP1H	(*(volatile unsigned char *)(REG_BASE + 0x0000002E))
#define BKP1L	(*(volatile unsigned char *)(REG_BASE + 0x0000002F))
#define PPAGE	(*(volatile unsigned char *)(REG_BASE + 0x00000030))

#define PIX0      	0x1
#define PIX1      	0x2
#define PIX2      	0x4
#define PIX3      	0x8
#define PIX4      	0x10
#define PIX5      	0x20
#define PIX       	0x3f

#define PORTK	(*(volatile unsigned char *)(REG_BASE + 0x00000032))
#define DDRK	(*(volatile unsigned char *)(REG_BASE + 0x00000033))

#define DDK0      	0x1
#define DDK1      	0x2
#define DDK2      	0x4
#define DDK3      	0x8
#define DDK4      	0x10
#define DDK5      	0x20
#define DDK7      	0x80
#define DDK       	0x3f

#define SYNR	(*(volatile unsigned char *)(REG_BASE + 0x00000034))

#define SYN0      	0x1
#define SYN1      	0x2
#define SYN2      	0x4
#define SYN3      	0x8
#define SYN4      	0x10
#define SYN5      	0x20
#define SYN       	0x3f

#define REFDV	(*(volatile unsigned char *)(REG_BASE + 0x00000035))

#define REFDV0    	0x1
#define REFDV1    	0x2
#define REFDV2    	0x4
#define REFDV3    	0x8

/* duplicate resolved by name mangling -- prepend REFDV */
#define REFDV_REFDV	0xf

#define CRGFLG	(*(volatile unsigned char *)(REG_BASE + 0x00000037))

#define SCM       	0x1
#define SCMIF     	0x2
#define TRACK     	0x4
#define LOCK      	0x8
#define LOCKIF    	0x10
#define PORF      	0x40
#define RTIF      	0x80

#define CRGINT	(*(volatile unsigned char *)(REG_BASE + 0x00000038))

#define SCMIE     	0x2
#define LOCKIE    	0x10
#define RTIE      	0x80

#define CLKSEL	(*(volatile unsigned char *)(REG_BASE + 0x00000039))

#define COPWAI    	0x1
#define RTIWAI    	0x2
#define CWAI      	0x4
#define PLLWAI    	0x8
#define ROAWAI    	0x10
#define SYSWAI    	0x20
#define PSTP      	0x40
#define PLLSEL    	0x80

#define PLLCTL	(*(volatile unsigned char *)(REG_BASE + 0x0000003A))

#define SCME      	0x1
#define ACQ       	0x10
#define AUTO      	0x20
#define PLLON     	0x40
#define CME       	0x80

#define RTICTL	(*(volatile unsigned char *)(REG_BASE + 0x0000003B))

#define RTR0      	0x1
#define RTR1      	0x2
#define RTR2      	0x4
#define RTR3      	0x8
#define RTR4      	0x10
#define RTR5      	0x20
#define RTR6      	0x40
#define RTR       	0x7f

#define COPCTL	(*(volatile unsigned char *)(REG_BASE + 0x0000003C))

#define CR0       	0x1
#define CR1       	0x2
#define CR2       	0x4
#define RSBCK     	0x40
#define WCOP      	0x80
#define CR        	0x7

#define ARMCOP	(*(volatile unsigned char *)(REG_BASE + 0x0000003F))
#define TIOS	(*(volatile unsigned char *)(REG_BASE + 0x00000040))

#define IOS0      	0x1
#define IOS1      	0x2
#define IOS2      	0x4
#define IOS3      	0x8
#define IOS4      	0x10
#define IOS5      	0x20
#define IOS6      	0x40
#define IOS7      	0x80
#define IOS       	0xff

#define CFORC	(*(volatile unsigned char *)(REG_BASE + 0x00000041))

#define FOC0      	0x1
#define FOC1      	0x2
#define FOC2      	0x4
#define FOC3      	0x8
#define FOC4      	0x10
#define FOC5      	0x20
#define FOC6      	0x40
#define FOC7      	0x80
#define FOC       	0xff

#define OC7M	(*(volatile unsigned char *)(REG_BASE + 0x00000042))

#define OC7M0     	0x1
#define OC7M1     	0x2
#define OC7M2     	0x4
#define OC7M3     	0x8
#define OC7M4     	0x10
#define OC7M5     	0x20
#define OC7M6     	0x40
#define OC7M7     	0x80

/* duplicate resolved by name mangling -- prepend OC7M */
#define OC7M_OC7M 	0xff

#define OC7D	(*(volatile unsigned char *)(REG_BASE + 0x00000043))

/* duplicate resolved by name mangling -- prepend OC7D */

#define OC7D_OC7D 	0xff

#define TCNT	(*(volatile unsigned *)(REG_BASE + 0x00000044))
#define TSCR1	(*(volatile unsigned char *)(REG_BASE + 0x00000046))

#define TFFCA     	0x10
#define TSFRZ     	0x20
#define TSWAI     	0x40
#define TEN       	0x80

#define TTOV	(*(volatile unsigned char *)(REG_BASE + 0x00000047))

#define TOV0      	0x1
#define TOV1      	0x2
#define TOV2      	0x4
#define TOV3      	0x8
#define TOV4      	0x10
#define TOV5      	0x20
#define TOV6      	0x40
#define TOV7      	0x80
#define TOV       	0xff

#define TCTL1	(*(volatile unsigned char *)(REG_BASE + 0x00000048))

#define OL4       	0x1
#define OM4       	0x2
#define OL5       	0x4
#define OM5       	0x8
#define OL6       	0x10
#define OM6       	0x20
#define OL7       	0x40
#define OM7       	0x80

#define TCTL2	(*(volatile unsigned char *)(REG_BASE + 0x00000049))

#define OL0       	0x1
#define OM0       	0x2
#define OL1       	0x4
#define OM1       	0x8
#define OL2       	0x10
#define OM2       	0x20
#define OL3       	0x40
#define OM3       	0x80

#define TCTL3	(*(volatile unsigned char *)(REG_BASE + 0x0000004A))

#define EDG4A     	0x1
#define EDG4B     	0x2
#define EDG5A     	0x4
#define EDG5B     	0x8
#define EDG6A     	0x10
#define EDG6B     	0x20
#define EDG7A     	0x40
#define EDG7B     	0x80
#define EDG4x     	0x3
#define EDG6x     	0x30

#define TCTL4	(*(volatile unsigned char *)(REG_BASE + 0x0000004B))

#define EDG0A     	0x1
#define EDG0B     	0x2
#define EDG1A     	0x4
#define EDG1B     	0x8
#define EDG2A     	0x10
#define EDG2B     	0x20
#define EDG3A     	0x40
#define EDG3B     	0x80
#define EDG0x     	0x3
#define EDG2x     	0x30

#define TIE	(*(volatile unsigned char *)(REG_BASE + 0x0000004C))

