dldavis007/dg128_gcc_motion/Embedded/Include/mc9s12dg128_imagecraft_reference.h
#define C0I       	0x1
#define C1I       	0x2
#define C2I       	0x4
#define C3I       	0x8
#define C4I       	0x10
#define C5I       	0x20
#define C6I       	0x40
#define C7I       	0x80

#define TSCR2	(*(volatile unsigned char *)(REG_BASE + 0x0000004D))

#define PR0       	0x1
#define PR1       	0x2
#define PR2       	0x4
#define TCRE      	0x8
#define TOI       	0x80
#define PR        	0x7

#define TFLG1	(*(volatile unsigned char *)(REG_BASE + 0x0000004E))

#define C0F       	0x1
#define C1F       	0x2
#define C2F       	0x4
#define C3F       	0x8
#define C4F       	0x10
#define C5F       	0x20
#define C6F       	0x40
#define C7F       	0x80

#define TFLG2	(*(volatile unsigned char *)(REG_BASE + 0x0000004F))

#define TOF       	0x80

#define TC0	(*(volatile unsigned *)(REG_BASE + 0x00000050))
#define TC1	(*(volatile unsigned *)(REG_BASE + 0x00000052))
#define TC2	(*(volatile unsigned *)(REG_BASE + 0x00000054))
#define TC3	(*(volatile unsigned *)(REG_BASE + 0x00000056))
#define TC4	(*(volatile unsigned *)(REG_BASE + 0x00000058))
#define TC5	(*(volatile unsigned *)(REG_BASE + 0x0000005A))
#define TC6	(*(volatile unsigned *)(REG_BASE + 0x0000005C))
#define TC7	(*(volatile unsigned *)(REG_BASE + 0x0000005E))
#define PACTL	(*(volatile unsigned char *)(REG_BASE + 0x00000060))

#define PAI       	0x1
#define PAOVI     	0x2
#define CLK0      	0x4
#define CLK1      	0x8
#define PEDGE     	0x10
#define PAMOD     	0x20
#define PAEN      	0x40
#define CLK       	0xc

#define PAFLG	(*(volatile unsigned char *)(REG_BASE + 0x00000061))

#define PAIF      	0x1
#define PAOVF     	0x2

#define PACN32	(*(volatile unsigned *)(REG_BASE + 0x00000062))
#define PACN10	(*(volatile unsigned *)(REG_BASE + 0x00000064))
#define MCCTL	(*(volatile unsigned char *)(REG_BASE + 0x00000066))

#define MCPR0     	0x1
#define MCPR1     	0x2
#define MCEN      	0x4
#define FLMC      	0x8
#define ICLAT     	0x10
#define RDMCL     	0x20
#define MODMC     	0x40
#define MCZI      	0x80
#define MCPR      	0x3

#define MCFLG	(*(volatile unsigned char *)(REG_BASE + 0x00000067))

#define POLF0     	0x1
#define POLF1     	0x2
#define POLF2     	0x4
#define POLF3     	0x8
#define MCZF      	0x80
#define POLF      	0xf

#define ICPAR	(*(volatile unsigned char *)(REG_BASE + 0x00000068))

#define PA0EN     	0x1
#define PA1EN     	0x2
#define PA2EN     	0x4
#define PA3EN     	0x8

#define DLYCT	(*(volatile unsigned char *)(REG_BASE + 0x00000069))

#define DLY0      	0x1
#define DLY1      	0x2
#define DLY       	0x3

#define ICOVW	(*(volatile unsigned char *)(REG_BASE + 0x0000006A))

#define NOVW0     	0x1
#define NOVW1     	0x2
#define NOVW2     	0x4
#define NOVW3     	0x8
#define NOVW4     	0x10
#define NOVW5     	0x20
#define NOVW6     	0x40
#define NOVW7     	0x80
#define NOVW      	0xff

#define ICSYS	(*(volatile unsigned char *)(REG_BASE + 0x0000006B))

#define LATQ      	0x1
#define BUFEN     	0x2
#define PACMX     	0x4
#define TFMOD     	0x8
#define SH04      	0x10
#define SH15      	0x20
#define SH26      	0x40
#define SH37      	0x80

#define PBCTL	(*(volatile unsigned char *)(REG_BASE + 0x00000070))

#define PBOVI     	0x2
#define PBEN      	0x40

#define PBFLG	(*(volatile unsigned char *)(REG_BASE + 0x00000071))

#define PBOVF     	0x2

#define PA32H	(*(volatile unsigned *)(REG_BASE + 0x00000072))
#define PA10H	(*(volatile unsigned *)(REG_BASE + 0x00000074))
#define MCCNT	(*(volatile unsigned *)(REG_BASE + 0x00000076))
#define TC0H	(*(volatile unsigned *)(REG_BASE + 0x00000078))
#define TC1H	(*(volatile unsigned *)(REG_BASE + 0x0000007A))
#define TC2H	(*(volatile unsigned *)(REG_BASE + 0x0000007C))
#define TC3H	(*(volatile unsigned *)(REG_BASE + 0x0000007E))
#define ATD0CTL23	(*(volatile unsigned *)(REG_BASE + 0x00000082))

#define ATD0CTL2	(*(volatile unsigned char*)(REG_BASE + 0x00000082))
#define ATD0CTL3	(*(volatile unsigned char*)(REG_BASE + 0x00000083))


#define FRZ0      	0x1
#define FRZ1      	0x2
#define FIFO      	0x4
#define S1C       	0x8
#define S2C       	0x10
#define S4C       	0x20
#define S8C       	0x40
#define ASCIF     	0x100
#define ASCIE     	0x200
#define ETRIGE    	0x400
#define ETRIGP    	0x800
#define ETRIGLE   	0x1000
#define AWAI      	0x2000
#define AFFC      	0x4000
#define ADPU      	0x8000
#define FRZ       	0x3

#define ATD0CTL45	(*(volatile unsigned *)(REG_BASE + 0x00000084))

#define ATD0CTL4	(*(volatile unsigned char*)(REG_BASE + 0x00000084))
#define ATD0CTL5	(*(volatile unsigned char*)(REG_BASE + 0x00000085))

#define CA        	0x1
#define CB        	0x2
#define CC        	0x4
#define MULT      	0x10
#define SCAN      	0x20
#define DSGN      	0x40
#define DJM       	0x80
#define PRS0      	0x100
#define PRS1      	0x200
#define PRS2      	0x400
#define PRS3      	0x800
#define PRS4      	0x1000
#define SMP0      	0x2000
#define SMP1      	0x4000
#define SRES8     	0x8000
#define Cx        	0x7
#define PRS       	0x1f00
#define SMP       	0x6000

#define ATD0STAT0	(*(volatile unsigned char *)(REG_BASE + 0x00000086))

#define CC0       	0x1
#define CC1       	0x2
#define CC2       	0x4
#define FIFOR     	0x10
#define ETORF     	0x20
#define SCF       	0x80

/* duplicate resolved by name mangling -- prepend ATD0STAT0 */
#define ATD0STAT0_CC	0x7

#define ATD0STAT1	(*(volatile unsigned char *)(REG_BASE + 0x0000008B))

#define CCF0      	0x1
#define CCF1      	0x2
#define CCF2      	0x4
#define CCF3      	0x8
#define CCF4      	0x10
#define CCF5      	0x20
#define CCF6      	0x40
#define CCF7      	0x80
#define CCF       	0xff

#define ATD0DIEN	(*(volatile unsigned char *)(REG_BASE + 0x0000008D))
#define PORTAD0	(*(volatile unsigned char *)(REG_BASE + 0x0000008F))
#define ATD0DR0	(*(volatile unsigned *)(REG_BASE + 0x00000090))
#define ATD0DR1	(*(volatile unsigned *)(REG_BASE + 0x00000092))
#define ATD0DR2	(*(volatile unsigned *)(REG_BASE + 0x00000094))
#define ATD0DR3	(*(volatile unsigned *)(REG_BASE + 0x00000096))
#define ATD0DR4	(*(volatile unsigned *)(REG_BASE + 0x00000098))
#define ATD0DR5	(*(volatile unsigned *)(REG_BASE + 0x0000009A))
#define ATD0DR6	(*(volatile unsigned *)(REG_BASE + 0x0000009C))
#define ATD0DR7	(*(volatile unsigned *)(REG_BASE + 0x0000009E))
#define PWME	(*(volatile unsigned char *)(REG_BASE + 0x000000A0))

