dldavis007/dg128_gcc_motion/Embedded/Include/mc9s12dg128_imagecraft_reference.h
#define PWME0     	0x1
#define PWME1     	0x2
#define PWME2     	0x4
#define PWME3     	0x8
#define PWME4     	0x10
#define PWME5     	0x20
#define PWME6     	0x40
#define PWME7     	0x80

/* duplicate resolved by name mangling -- prepend PWME */
#define PWME_PWME 	0xff

#define PWMPOL	(*(volatile unsigned char *)(REG_BASE + 0x000000A1))

#define PPOL0     	0x1
#define PPOL1     	0x2
#define PPOL2     	0x4
#define PPOL3     	0x8
#define PPOL4     	0x10
#define PPOL5     	0x20
#define PPOL6     	0x40
#define PPOL7     	0x80
#define PPOL      	0xff

#define PWMCLK	(*(volatile unsigned char *)(REG_BASE + 0x000000A2))

#define PCLK0     	0x1
#define PCLK1     	0x2
#define PCLK2     	0x4
#define PCLK3     	0x8
#define PCLK4     	0x10
#define PCLK5     	0x20
#define PCLK6     	0x40
#define PCLK7     	0x80
#define PCLK      	0xff

#define PWMPRCLK	(*(volatile unsigned char *)(REG_BASE + 0x000000A3))

#define PCKA0     	0x1
#define PCKA1     	0x2
#define PCKA2     	0x4
#define PCKB0     	0x10
#define PCKB1     	0x20
#define PCKB2     	0x40
#define PCKA      	0x7
#define PCKB      	0x70

#define PWMCAE	(*(volatile unsigned char *)(REG_BASE + 0x000000A4))

#define CAE0      	0x1
#define CAE1      	0x2
#define CAE2      	0x4
#define CAE3      	0x8
#define CAE4      	0x10
#define CAE5      	0x20
#define CAE6      	0x40
#define CAE7      	0x80
#define CAE       	0xff

#define PWMCTL	(*(volatile unsigned char *)(REG_BASE + 0x000000A5))

#define PFRZ      	0x4
#define PSWAI     	0x8
#define CON01     	0x10
#define CON23     	0x20
#define CON45     	0x40
#define CON67     	0x80

#define PWMSCLA	(*(volatile unsigned char *)(REG_BASE + 0x000000A8))
#define PWMSCLB	(*(volatile unsigned char *)(REG_BASE + 0x000000A9))
#define PWMCNT01	(*(volatile unsigned *)(REG_BASE + 0x000000AC))
#define PWMCNT23	(*(volatile unsigned *)(REG_BASE + 0x000000AE))
#define PWMCNT45	(*(volatile unsigned *)(REG_BASE + 0x000000B0))
#define PWMCNT67	(*(volatile unsigned *)(REG_BASE + 0x000000B2))
#define PWMPER01	(*(volatile unsigned *)(REG_BASE + 0x000000B4))
#define PWMPER23	(*(volatile unsigned *)(REG_BASE + 0x000000B6))
#define PWMPER45	(*(volatile unsigned *)(REG_BASE + 0x000000B8))
#define PWMPER67	(*(volatile unsigned *)(REG_BASE + 0x000000BA))
#define PWMDTY01	(*(volatile unsigned *)(REG_BASE + 0x000000BC))
#define PWMDTY23	(*(volatile unsigned *)(REG_BASE + 0x000000BE))
#define PWMDTY45	(*(volatile unsigned *)(REG_BASE + 0x000000C0))
#define PWMDTY67	(*(volatile unsigned *)(REG_BASE + 0x000000C2))
#define PWMSDN	(*(volatile unsigned char *)(REG_BASE + 0x000000C4))

#define PWMCNT0	(*(volatile unsigned  char *)(REG_BASE + 0x000000AC))
#define PWMCNT1	(*(volatile unsigned  char *)(REG_BASE + 0x000000AD))
#define PWMCNT2	(*(volatile unsigned  char *)(REG_BASE + 0x000000AE))
#define PWMCNT3	(*(volatile unsigned  char *)(REG_BASE + 0x000000AF))
#define PWMCNT4	(*(volatile unsigned  char *)(REG_BASE + 0x000000B0))
#define PWMCNT5 (*(volatile unsigned  char *)(REG_BASE + 0x000000B1))
#define PWMCNT6	(*(volatile unsigned  char *)(REG_BASE + 0x000000B2))
#define PWMCNT7	(*(volatile unsigned  char *)(REG_BASE + 0x000000B3))

#define PWMPER0	(*(volatile unsigned  char *)(REG_BASE + 0x000000B4))
#define PWMPER1	(*(volatile unsigned  char *)(REG_BASE + 0x000000B5))
#define PWMPER2	(*(volatile unsigned  char *)(REG_BASE + 0x000000B6))
#define PWMPER3	(*(volatile unsigned  char *)(REG_BASE + 0x000000B7))
#define PWMPER4	(*(volatile unsigned  char *)(REG_BASE + 0x000000B8))
#define PWMPER5	(*(volatile unsigned  char *)(REG_BASE + 0x000000B9))
#define PWMPER6	(*(volatile unsigned  char *)(REG_BASE + 0x000000BA))
#define PWMPER7	(*(volatile unsigned  char *)(REG_BASE + 0x000000BB))

#define PWMDTY0	(*(volatile unsigned  char *)(REG_BASE + 0x000000BC))
#define PWMDTY1	(*(volatile unsigned  char *)(REG_BASE + 0x000000BD))
#define PWMDTY2	(*(volatile unsigned  char *)(REG_BASE + 0x000000BE))
#define PWMDTY3	(*(volatile unsigned  char *)(REG_BASE + 0x000000BF))
#define PWMDTY4	(*(volatile unsigned  char *)(REG_BASE + 0x000000C0))
#define PWMDTY5	(*(volatile unsigned  char *)(REG_BASE + 0x000000C1))
#define PWMDTY6	(*(volatile unsigned  char *)(REG_BASE + 0x000000C2))
#define PWMDTY7	(*(volatile unsigned  char *)(REG_BASE + 0x000000C3))

#define PWM7ENA   	0x1
#define PWM7INL   	0x2
#define PWM7IN    	0x4
#define PWMLVL    	0x10
#define PWMRSTRT  	0x20
#define PWMIE     	0x40
#define PWMIF     	0x80

#define SCI0BD	(*(volatile unsigned *)(REG_BASE + 0x000000C8))

#define SBR0      	0x1
#define SBR1      	0x2
#define SBR2      	0x4
#define SBR3      	0x8
#define SBR4      	0x10
#define SBR5      	0x20
#define SBR6      	0x40
#define SBR7      	0x80
#define SBR8      	0x100
#define SBR9      	0x200
#define SBR10     	0x400
#define SBR11     	0x800
#define SBR12     	0x1000
#define SBR       	0x1fff

#define SCI0CR1	(*(volatile unsigned char *)(REG_BASE + 0x000000CA))

#define PT        	0x1
#define PE        	0x2
#define ILT       	0x4
#define WAKE      	0x8
#define M         	0x10
#define RSRC      	0x20
#define SCISWAI   	0x40
#define LOOPS     	0x80

#define SCI0CR2	(*(volatile unsigned char *)(REG_BASE + 0x000000CB))

#define SBK       	0x1
#define RWU       	0x2
#define RE        	0x4
#define TE        	0x8
#define ILIE      	0x10
#define RIE       	0x20
#define TCIE      	0x40
#define SCTIE     	0x80

#define SCI0SR1	(*(volatile unsigned char *)(REG_BASE + 0x000000CC))

#define PF        	0x1
#define FE        	0x2
#define NF        	0x4
#define OR        	0x8
#define IDLE      	0x10
#define RDRF      	0x20
#define TC        	0x40
#define TDRE      	0x80

#define SCI0SR2	(*(volatile unsigned char *)(REG_BASE + 0x000000CD))

#define RAF       	0x1
#define TXDIR     	0x2
#define BRK13     	0x4

#define SCI0DRH	(*(volatile unsigned char *)(REG_BASE + 0x000000CE))

#define T8        	0x40
#define R8        	0x80

#define SCI0DRL	(*(volatile unsigned char *)(REG_BASE + 0x000000CF))

#define T0        	0x1
#define T1        	0x2
#define T2        	0x4
#define T3        	0x8
#define T4        	0x10
#define T5        	0x20
#define T6        	0x40
#define T7        	0x80

#define SCI1BD	(*(volatile unsigned *)(REG_BASE + 0x000000D0))

/* duplicate resolved by name mangling -- prepend SCI1BD */

#define SCI1BD_SBR0	0x1

/* duplicate resolved by name mangling -- prepend SCI1BD */
#define SCI1BD_SBR1	0x2

/* duplicate resolved by name mangling -- prepend SCI1BD */
#define SCI1BD_SBR2	0x4

/* duplicate resolved by name mangling -- prepend SCI1BD */
#define SCI1BD_SBR3	0x8

/* duplicate resolved by name mangling -- prepend SCI1BD */
#define SCI1BD_SBR4	0x10

/* duplicate resolved by name mangling -- prepend SCI1BD */
#define SCI1BD_SBR5	0x20

/* duplicate resolved by name mangling -- prepend SCI1BD */
#define SCI1BD_SBR6	0x40

/* duplicate resolved by name mangling -- prepend SCI1BD */
#define SCI1BD_SBR7	0x80

/* duplicate resolved by name mangling -- prepend SCI1BD */
#define SCI1BD_SBR8	0x100

/* duplicate resolved by name mangling -- prepend SCI1BD */
#define SCI1BD_SBR9	0x200

/* duplicate resolved by name mangling -- prepend SCI1BD */
#define SCI1BD_SBR10	0x400

/* duplicate resolved by name mangling -- prepend SCI1BD */
#define SCI1BD_SBR11	0x800

/* duplicate resolved by name mangling -- prepend SCI1BD */
#define SCI1BD_SBR12	0x1000

/* duplicate resolved by name mangling -- prepend SCI1BD */
#define SCI1BD_SBR	0x1fff

#define SCI1CR1	(*(volatile unsigned char *)(REG_BASE + 0x000000D2))

/* duplicate resolved by name mangling -- prepend SCI1CR1 */

