dldavis007/dg128_gcc_motion/Embedded/Include/mc9s12dg128_imagecraft_reference.h
#define SCI1CR1_PT	0x1

/* duplicate resolved by name mangling -- prepend SCI1CR1 */
#define SCI1CR1_PE	0x2

/* duplicate resolved by name mangling -- prepend SCI1CR1 */
#define SCI1CR1_ILT	0x4

/* duplicate resolved by name mangling -- prepend SCI1CR1 */
#define SCI1CR1_WAKE	0x8

/* duplicate resolved by name mangling -- prepend SCI1CR1 */
#define SCI1CR1_M 	0x10

/* duplicate resolved by name mangling -- prepend SCI1CR1 */
#define SCI1CR1_RSRC	0x20

/* duplicate resolved by name mangling -- prepend SCI1CR1 */
#define SCI1CR1_SCISWAI	0x40

/* duplicate resolved by name mangling -- prepend SCI1CR1 */
#define SCI1CR1_LOOPS	0x80

#define SCI1CR2	(*(volatile unsigned char *)(REG_BASE + 0x000000D3))

/* duplicate resolved by name mangling -- prepend SCI1CR2 */

#define SCI1CR2_SBK	0x1

/* duplicate resolved by name mangling -- prepend SCI1CR2 */
#define SCI1CR2_RWU	0x2

/* duplicate resolved by name mangling -- prepend SCI1CR2 */
#define SCI1CR2_RE	0x4

/* duplicate resolved by name mangling -- prepend SCI1CR2 */
#define SCI1CR2_TE	0x8

/* duplicate resolved by name mangling -- prepend SCI1CR2 */
#define SCI1CR2_ILIE	0x10

/* duplicate resolved by name mangling -- prepend SCI1CR2 */
#define SCI1CR2_RIE	0x20

/* duplicate resolved by name mangling -- prepend SCI1CR2 */
#define SCI1CR2_TCIE	0x40

/* duplicate resolved by name mangling -- prepend SCI1CR2 */
#define SCI1CR2_SCTIE	0x80

#define SCI1SR1	(*(volatile unsigned char *)(REG_BASE + 0x000000D4))

/* duplicate resolved by name mangling -- prepend SCI1SR1 */

#define SCI1SR1_PF	0x1

/* duplicate resolved by name mangling -- prepend SCI1SR1 */
#define SCI1SR1_FE	0x2

/* duplicate resolved by name mangling -- prepend SCI1SR1 */
#define SCI1SR1_NF	0x4

/* duplicate resolved by name mangling -- prepend SCI1SR1 */
#define SCI1SR1_OR	0x8

/* duplicate resolved by name mangling -- prepend SCI1SR1 */
#define SCI1SR1_IDLE	0x10

/* duplicate resolved by name mangling -- prepend SCI1SR1 */
#define SCI1SR1_RDRF	0x20

/* duplicate resolved by name mangling -- prepend SCI1SR1 */
#define SCI1SR1_TC	0x40

/* duplicate resolved by name mangling -- prepend SCI1SR1 */
#define SCI1SR1_TDRE	0x80

#define SCI1SR2	(*(volatile unsigned char *)(REG_BASE + 0x000000D5))

/* duplicate resolved by name mangling -- prepend SCI1SR2 */

#define SCI1SR2_RAF	0x1

/* duplicate resolved by name mangling -- prepend SCI1SR2 */
#define SCI1SR2_TXDIR	0x2

/* duplicate resolved by name mangling -- prepend SCI1SR2 */
#define SCI1SR2_BRK13	0x4

#define SCI1DRH	(*(volatile unsigned char *)(REG_BASE + 0x000000D6))

/* duplicate resolved by name mangling -- prepend SCI1DRH */

#define SCI1DRH_T8	0x40

/* duplicate resolved by name mangling -- prepend SCI1DRH */
#define SCI1DRH_R8	0x80

#define SCI1DRL	(*(volatile unsigned char *)(REG_BASE + 0x000000D7))

/* duplicate resolved by name mangling -- prepend SCI1DRL_R0 */

#define SCI1DRL_R0_T0	0x1

/* duplicate resolved by name mangling -- prepend SCI1DRL_R1 */
#define SCI1DRL_R1_T1	0x2

/* duplicate resolved by name mangling -- prepend SCI1DRL_R2 */
#define SCI1DRL_R2_T2	0x4

/* duplicate resolved by name mangling -- prepend SCI1DRL_R3 */
#define SCI1DRL_R3_T3	0x8

/* duplicate resolved by name mangling -- prepend SCI1DRL_R4 */
#define SCI1DRL_R4_T4	0x10

/* duplicate resolved by name mangling -- prepend SCI1DRL_R5 */
#define SCI1DRL_R5_T5	0x20

/* duplicate resolved by name mangling -- prepend SCI1DRL_R6 */
#define SCI1DRL_R6_T6	0x40

/* duplicate resolved by name mangling -- prepend SCI1DRL_R7 */
#define SCI1DRL_R7_T7	0x80

#define SPI0CR1	(*(volatile unsigned char *)(REG_BASE + 0x000000D8))

#define LSBFE     	0x1
#define SSOE      	0x2
#define CPHA      	0x4
#define CPOL      	0x8
#define MSTR      	0x10
#define SPTIE     	0x20
#define SPE       	0x40
#define SPIE      	0x80

#define SPI0CR2	(*(volatile unsigned char *)(REG_BASE + 0x000000D9))

#define SPC0      	0x1
#define SPISWAI   	0x2
#define BIDIROE   	0x8
#define MODFEN    	0x10

#define SPI0BR	(*(volatile unsigned char *)(REG_BASE + 0x000000DA))

#define SPR0      	0x1
#define SPR1      	0x2
#define SPR2      	0x4
#define SPPR0     	0x10
#define SPPR1     	0x20
#define SPPR2     	0x40
#define SPR       	0x7
#define SPPR      	0x70

#define SPI0SR	(*(volatile unsigned char *)(REG_BASE + 0x000000DB))

#define MODF      	0x10
#define SPTEF     	0x20
#define SPIF      	0x80

#define SPI0DR	(*(volatile unsigned char *)(REG_BASE + 0x000000DD))
#define IBAD	(*(volatile unsigned char *)(REG_BASE + 0x000000E0))

/* duplicate resolved by name mangling -- prepend IBAD */

#define IBAD_ADR1 	0x2

/* duplicate resolved by name mangling -- prepend IBAD */
#define IBAD_ADR2 	0x4

/* duplicate resolved by name mangling -- prepend IBAD */
#define IBAD_ADR3 	0x8
#define ADR4      	0x10
#define ADR5      	0x20
#define ADR6      	0x40
#define ADR7      	0x80
#define ADR_1     	0xfe

#define IBFD	(*(volatile unsigned char *)(REG_BASE + 0x000000E1))

#define IBC0      	0x1
#define IBC1      	0x2
#define IBC2      	0x4
#define IBC3      	0x8
#define IBC4      	0x10
#define IBC5      	0x20
#define IBC6      	0x40
#define IBC7      	0x80
#define IBC       	0xff

#define IBCR	(*(volatile unsigned char *)(REG_BASE + 0x000000E2))

#define IBSWAI    	0x1
#define RSTA      	0x4
#define TXAK      	0x8
#define RX        	0x10
#define SL        	0x20
#define IBIE      	0x40
#define IBEN      	0x80

#define IBSR	(*(volatile unsigned char *)(REG_BASE + 0x000000E3))

#define RXAK      	0x1
#define IBIF      	0x2
#define SRW       	0x4
#define IBAL      	0x10
#define IBB       	0x20
#define IAAS      	0x40
#define TCF       	0x80

#define IBDR	(*(volatile unsigned char *)(REG_BASE + 0x000000E4))

#define D0        	0x1
#define D1        	0x2
#define D2        	0x4
#define D3        	0x8
#define D4        	0x10
#define D5        	0x20
#define D6        	0x40
#define D7        	0x80
#define D         	0xff

#define SPI1CR1	(*(volatile unsigned char *)(REG_BASE + 0x000000F0))

/* duplicate resolved by name mangling -- prepend SPI1CR1 */

