dldavis007/dg128_gcc_motion/Embedded/Include/mc9s12dg128_imagecraft_reference.h
#define SPI1CR1_LSBFE	0x1

/* duplicate resolved by name mangling -- prepend SPI1CR1 */
#define SPI1CR1_SSOE	0x2

/* duplicate resolved by name mangling -- prepend SPI1CR1 */
#define SPI1CR1_CPHA	0x4

/* duplicate resolved by name mangling -- prepend SPI1CR1 */
#define SPI1CR1_CPOL	0x8

/* duplicate resolved by name mangling -- prepend SPI1CR1 */
#define SPI1CR1_MSTR	0x10

/* duplicate resolved by name mangling -- prepend SPI1CR1 */
#define SPI1CR1_SPTIE	0x20

/* duplicate resolved by name mangling -- prepend SPI1CR1 */
#define SPI1CR1_SPE	0x40

/* duplicate resolved by name mangling -- prepend SPI1CR1 */
#define SPI1CR1_SPIE	0x80

#define SPI1CR2	(*(volatile unsigned char *)(REG_BASE + 0x000000F1))

/* duplicate resolved by name mangling -- prepend SPI1CR2 */

#define SPI1CR2_SPC0	0x1

/* duplicate resolved by name mangling -- prepend SPI1CR2 */
#define SPI1CR2_SPISWAI	0x2

/* duplicate resolved by name mangling -- prepend SPI1CR2 */
#define SPI1CR2_BIDIROE	0x8

/* duplicate resolved by name mangling -- prepend SPI1CR2 */
#define SPI1CR2_MODFEN	0x10

#define SPI1BR	(*(volatile unsigned char *)(REG_BASE + 0x000000F2))

/* duplicate resolved by name mangling -- prepend SPI1BR */

#define SPI1BR_SPR0	0x1

/* duplicate resolved by name mangling -- prepend SPI1BR */
#define SPI1BR_SPR1	0x2

/* duplicate resolved by name mangling -- prepend SPI1BR */
#define SPI1BR_SPR2	0x4

/* duplicate resolved by name mangling -- prepend SPI1BR */
#define SPI1BR_SPPR0	0x10

/* duplicate resolved by name mangling -- prepend SPI1BR */
#define SPI1BR_SPPR1	0x20

/* duplicate resolved by name mangling -- prepend SPI1BR */
#define SPI1BR_SPPR2	0x40

/* duplicate resolved by name mangling -- prepend SPI1BR */
#define SPI1BR_SPR	0x7

/* duplicate resolved by name mangling -- prepend SPI1BR */
#define SPI1BR_SPPR	0x70

#define SPI1SR	(*(volatile unsigned char *)(REG_BASE + 0x000000F3))

/* duplicate resolved by name mangling -- prepend SPI1SR */

#define SPI1SR_MODF	0x10

/* duplicate resolved by name mangling -- prepend SPI1SR */
#define SPI1SR_SPTEF	0x20

/* duplicate resolved by name mangling -- prepend SPI1SR */
#define SPI1SR_SPIF	0x80

#define SPI1DR	(*(volatile unsigned char *)(REG_BASE + 0x000000F5))
#define FCLKDIV	(*(volatile unsigned char *)(REG_BASE + 0x00000100))

#define FDIV0     	0x1
#define FDIV1     	0x2
#define FDIV2     	0x4
#define FDIV3     	0x8
#define FDIV4     	0x10
#define FDIV5     	0x20
#define PRDIV8    	0x40
#define FDIVLD    	0x80
#define FDIV      	0x3f

#define FSEC	(*(volatile unsigned char *)(REG_BASE + 0x00000101))

#define SEC0      	0x1
#define SEC1      	0x2
#define NV2       	0x4
#define NV3       	0x8
#define NV4       	0x10
#define NV5       	0x20
#define NV6       	0x40
#define KEYEN     	0x80
#define SEC       	0x3
#define NV_2      	0x7c

#define FCNFG	(*(volatile unsigned char *)(REG_BASE + 0x00000103))

#define BKSEL     	0x1
#define KEYACC    	0x20
#define CCIE      	0x40
#define CBEIE     	0x80

#define FPROT	(*(volatile unsigned char *)(REG_BASE + 0x00000104))

#define FPLS0     	0x1
#define FPLS1     	0x2
#define FPLDIS    	0x4
#define FPHS0     	0x8
#define FPHS1     	0x10
#define FPHDIS    	0x20

/* duplicate resolved by name mangling -- prepend FPROT */
#define FPROT_NV6 	0x40
#define FPOPEN    	0x80
#define FPLS      	0x3
#define FPHS      	0x18

#define FSTAT	(*(volatile unsigned char *)(REG_BASE + 0x00000105))

#define BLANK     	0x4
#define ACCERR    	0x10
#define PVIOL     	0x20
#define CCIF      	0x40
#define CBEIF     	0x80

#define FCMD	(*(volatile unsigned char *)(REG_BASE + 0x00000106))

#define CMDB0     	0x1
#define CMDB2     	0x4
#define CMDB5     	0x20
#define CMDB6     	0x40
#define CMDB_5    	0x60

#define ECLKDIV	(*(volatile unsigned char *)(REG_BASE + 0x00000110))

#define EDIV0     	0x1
#define EDIV1     	0x2
#define EDIV2     	0x4
#define EDIV3     	0x8
#define EDIV4     	0x10
#define EDIV5     	0x20

/* duplicate resolved by name mangling -- prepend ECLKDIV */
#define ECLKDIV_PRDIV8	0x40
#define EDIVLD    	0x80
#define EDIV      	0x3f

#define ECNFG	(*(volatile unsigned char *)(REG_BASE + 0x00000113))

/* duplicate resolved by name mangling -- prepend ECNFG */

#define ECNFG_CCIE	0x40

/* duplicate resolved by name mangling -- prepend ECNFG */
#define ECNFG_CBEIE	0x80

#define EPROT	(*(volatile unsigned char *)(REG_BASE + 0x00000114))

#define EP0       	0x1
#define EP1       	0x2
#define EP2       	0x4
#define EPDIS     	0x8
#define EPOPEN    	0x80
#define EP        	0x7

#define ESTAT	(*(volatile unsigned char *)(REG_BASE + 0x00000115))

/* duplicate resolved by name mangling -- prepend ESTAT */

#define ESTAT_BLANK	0x4

/* duplicate resolved by name mangling -- prepend ESTAT */
#define ESTAT_ACCERR	0x10

/* duplicate resolved by name mangling -- prepend ESTAT */
#define ESTAT_PVIOL	0x20

/* duplicate resolved by name mangling -- prepend ESTAT */
#define ESTAT_CCIF	0x40

/* duplicate resolved by name mangling -- prepend ESTAT */
#define ESTAT_CBEIF	0x80

#define ECMD	(*(volatile unsigned char *)(REG_BASE + 0x00000116))

/* duplicate resolved by name mangling -- prepend ECMD */

#define ECMD_CMDB0	0x1

/* duplicate resolved by name mangling -- prepend ECMD */
#define ECMD_CMDB2	0x4

/* duplicate resolved by name mangling -- prepend ECMD */
#define ECMD_CMDB5	0x20

/* duplicate resolved by name mangling -- prepend ECMD */
#define ECMD_CMDB6	0x40

/* duplicate resolved by name mangling -- prepend ECMD */
#define ECMD_CMDB_5	0x60

#define ATD1CTL23	(*(volatile unsigned *)(REG_BASE + 0x00000122))

#define ATD1CTL2	(*(volatile unsigned char*)(REG_BASE + 0x00000122))
#define ATD1CTL3	(*(volatile unsigned char*)(REG_BASE + 0x00000123))

/* duplicate resolved by name mangling -- prepend ATD1CTL23 */

#define ATD1CTL23_FRZ0	0x1

/* duplicate resolved by name mangling -- prepend ATD1CTL23 */
#define ATD1CTL23_FRZ1	0x2

/* duplicate resolved by name mangling -- prepend ATD1CTL23 */
#define ATD1CTL23_FIFO	0x4

/* duplicate resolved by name mangling -- prepend ATD1CTL23 */
#define ATD1CTL23_S1C	0x8

/* duplicate resolved by name mangling -- prepend ATD1CTL23 */
#define ATD1CTL23_S2C	0x10

/* duplicate resolved by name mangling -- prepend ATD1CTL23 */
#define ATD1CTL23_S4C	0x20

/* duplicate resolved by name mangling -- prepend ATD1CTL23 */
#define ATD1CTL23_S8C	0x40

/* duplicate resolved by name mangling -- prepend ATD1CTL23 */
#define ATD1CTL23_ASCIF	0x100

/* duplicate resolved by name mangling -- prepend ATD1CTL23 */
#define ATD1CTL23_ASCIE	0x200

/* duplicate resolved by name mangling -- prepend ATD1CTL23 */
#define ATD1CTL23_ETRIGE	0x400

/* duplicate resolved by name mangling -- prepend ATD1CTL23 */
#define ATD1CTL23_ETRIGP	0x800

/* duplicate resolved by name mangling -- prepend ATD1CTL23 */
#define ATD1CTL23_ETRIGLE	0x1000

/* duplicate resolved by name mangling -- prepend ATD1CTL23 */
#define ATD1CTL23_AWAI	0x2000

/* duplicate resolved by name mangling -- prepend ATD1CTL23 */
#define ATD1CTL23_AFFC	0x4000

/* duplicate resolved by name mangling -- prepend ATD1CTL23 */
#define ATD1CTL23_ADPU	0x8000

/* duplicate resolved by name mangling -- prepend ATD1CTL23 */
#define ATD1CTL23_FRZ	0x3

