dldavis007/dg128_gcc_motion/Embedded/Include/mc9s12dg128_imagecraft_reference.h
#define ATD1CTL45	(*(volatile unsigned *)(REG_BASE + 0x00000124))

#define ATD1CTL4	(*(volatile unsigned char*)(REG_BASE + 0x00000124))
#define ATD1CTL5	(*(volatile unsigned char*)(REG_BASE + 0x00000125))

/* duplicate resolved by name mangling -- prepend ATD1CTL45 */

#define ATD1CTL45_CA	0x1

/* duplicate resolved by name mangling -- prepend ATD1CTL45 */
#define ATD1CTL45_CB	0x2

/* duplicate resolved by name mangling -- prepend ATD1CTL45 */
#define ATD1CTL45_CC	0x4

/* duplicate resolved by name mangling -- prepend ATD1CTL45 */
#define ATD1CTL45_MULT	0x10

/* duplicate resolved by name mangling -- prepend ATD1CTL45 */
#define ATD1CTL45_SCAN	0x20

/* duplicate resolved by name mangling -- prepend ATD1CTL45 */
#define ATD1CTL45_DSGN	0x40

/* duplicate resolved by name mangling -- prepend ATD1CTL45 */
#define ATD1CTL45_DJM	0x80

/* duplicate resolved by name mangling -- prepend ATD1CTL45 */
#define ATD1CTL45_PRS0	0x100

/* duplicate resolved by name mangling -- prepend ATD1CTL45 */
#define ATD1CTL45_PRS1	0x200

/* duplicate resolved by name mangling -- prepend ATD1CTL45 */
#define ATD1CTL45_PRS2	0x400

/* duplicate resolved by name mangling -- prepend ATD1CTL45 */
#define ATD1CTL45_PRS3	0x800

/* duplicate resolved by name mangling -- prepend ATD1CTL45 */
#define ATD1CTL45_PRS4	0x1000

/* duplicate resolved by name mangling -- prepend ATD1CTL45 */
#define ATD1CTL45_SMP0	0x2000

/* duplicate resolved by name mangling -- prepend ATD1CTL45 */
#define ATD1CTL45_SMP1	0x4000

/* duplicate resolved by name mangling -- prepend ATD1CTL45 */
#define ATD1CTL45_SRES8	0x8000

/* duplicate resolved by name mangling -- prepend ATD1CTL45 */
#define ATD1CTL45_Cx	0x7

/* duplicate resolved by name mangling -- prepend ATD1CTL45 */
#define ATD1CTL45_PRS	0x1f00

/* duplicate resolved by name mangling -- prepend ATD1CTL45 */
#define ATD1CTL45_SMP	0x6000

#define ATD1STAT0	(*(volatile unsigned char *)(REG_BASE + 0x00000126))

/* duplicate resolved by name mangling -- prepend ATD1STAT0 */

#define ATD1STAT0_CC0	0x1

/* duplicate resolved by name mangling -- prepend ATD1STAT0 */
#define ATD1STAT0_CC1	0x2

/* duplicate resolved by name mangling -- prepend ATD1STAT0 */
#define ATD1STAT0_CC2	0x4

/* duplicate resolved by name mangling -- prepend ATD1STAT0 */
#define ATD1STAT0_FIFOR	0x10

/* duplicate resolved by name mangling -- prepend ATD1STAT0 */
#define ATD1STAT0_ETORF	0x20

/* duplicate resolved by name mangling -- prepend ATD1STAT0 */
#define ATD1STAT0_SCF	0x80

/* duplicate resolved by name mangling -- prepend ATD1STAT0 */
#define ATD1STAT0_CC	0x7

#define ATD1STAT1	(*(volatile unsigned char *)(REG_BASE + 0x0000012B))

/* duplicate resolved by name mangling -- prepend ATD1STAT1 */

#define ATD1STAT1_CCF0	0x1

/* duplicate resolved by name mangling -- prepend ATD1STAT1 */
#define ATD1STAT1_CCF1	0x2

/* duplicate resolved by name mangling -- prepend ATD1STAT1 */
#define ATD1STAT1_CCF2	0x4

/* duplicate resolved by name mangling -- prepend ATD1STAT1 */
#define ATD1STAT1_CCF3	0x8

/* duplicate resolved by name mangling -- prepend ATD1STAT1 */
#define ATD1STAT1_CCF4	0x10

/* duplicate resolved by name mangling -- prepend ATD1STAT1 */
#define ATD1STAT1_CCF5	0x20

/* duplicate resolved by name mangling -- prepend ATD1STAT1 */
#define ATD1STAT1_CCF6	0x40

/* duplicate resolved by name mangling -- prepend ATD1STAT1 */
#define ATD1STAT1_CCF7	0x80

/* duplicate resolved by name mangling -- prepend ATD1STAT1 */
#define ATD1STAT1_CCF	0xff

#define ATD1DIEN	(*(volatile unsigned char *)(REG_BASE + 0x0000012D))
#define PORTAD1	(*(volatile unsigned char *)(REG_BASE + 0x0000012F))
#define ATD1DR0	(*(volatile unsigned *)(REG_BASE + 0x00000130))
#define ATD1DR1	(*(volatile unsigned *)(REG_BASE + 0x00000132))
#define ATD1DR2	(*(volatile unsigned *)(REG_BASE + 0x00000134))
#define ATD1DR3	(*(volatile unsigned *)(REG_BASE + 0x00000136))
#define ATD1DR4	(*(volatile unsigned *)(REG_BASE + 0x00000138))
#define ATD1DR5	(*(volatile unsigned *)(REG_BASE + 0x0000013A))
#define ATD1DR6	(*(volatile unsigned *)(REG_BASE + 0x0000013C))
#define ATD1DR7	(*(volatile unsigned *)(REG_BASE + 0x0000013E))
#define CANCTL0	(*(volatile unsigned char *)(REG_BASE + 0x00000140))

#define INITRQ    	0x1
#define SLPRQ     	0x2
#define WUPE      	0x4
#define TIME      	0x8
#define SYNCH     	0x10
#define CSWAI     	0x20
#define RXACT     	0x40
#define RXFRM     	0x80

#define CANCTL1	(*(volatile unsigned char *)(REG_BASE + 0x00000141))

#define INITAK    	0x1
#define SLPAK     	0x2
#define WUPM      	0x4
#define LISTEN    	0x10
#define LOOPB     	0x20
#define CLKSRC    	0x40
#define CANE      	0x80

#define CANBTR0	(*(volatile unsigned char *)(REG_BASE + 0x00000142))

#define BRP0      	0x1
#define BRP1      	0x2
#define BRP2      	0x4
#define BRP3      	0x8
#define BRP4      	0x10
#define BRP5      	0x20
#define SJW0      	0x40
#define SJW1      	0x80
#define BRP       	0x3f
#define SJW       	0xc0

#define CANBTR1	(*(volatile unsigned char *)(REG_BASE + 0x00000143))

#define TSEG10    	0x1
#define TSEG11    	0x2
#define TSEG12    	0x4
#define TSEG13    	0x8
#define TSEG20    	0x10
#define TSEG21    	0x20
#define TSEG22    	0x40
#define SAMP      	0x80
#define TSEG_10   	0xf
#define TSEG_20   	0x70

#define CANRFLG	(*(volatile unsigned char *)(REG_BASE + 0x00000144))

#define RXF       	0x1
#define OVRIF     	0x2
#define TSTAT0    	0x4
#define TSTAT1    	0x8
#define RSTAT0    	0x10
#define RSTAT1    	0x20
#define CSCIF     	0x40
#define WUPIF     	0x80
#define TSTAT     	0xc
#define RSTAT     	0x30

#define CANRIER	(*(volatile unsigned char *)(REG_BASE + 0x00000145))

#define RXFIE     	0x1
#define OVRIE     	0x2
#define TSTATE0   	0x4
#define TSTATE1   	0x8
#define RSTATE0   	0x10
#define RSTATE1   	0x20
#define CSCIE     	0x40
#define WUPIE     	0x80
#define TSTATE    	0xc
#define RSTATE    	0x30

#define CANTFLG	(*(volatile unsigned char *)(REG_BASE + 0x00000146))

#define TXE0      	0x1
#define TXE1      	0x2
#define TXE2      	0x4
#define TXE       	0x7

