dldavis007/dg128_gcc_motion/Embedded/Include/mc9s12dg128_imagecraft_reference.h
#define CANTIER	(*(volatile unsigned char *)(REG_BASE + 0x00000147))

#define TXEIE0    	0x1
#define TXEIE1    	0x2
#define TXEIE2    	0x4
#define TXEIE     	0x7

#define CANTARQ	(*(volatile unsigned char *)(REG_BASE + 0x00000148))

#define ABTRQ0    	0x1
#define ABTRQ1    	0x2
#define ABTRQ2    	0x4
#define ABTRQ     	0x7

#define CANTAAK	(*(volatile unsigned char *)(REG_BASE + 0x00000149))

#define ABTAK0    	0x1
#define ABTAK1    	0x2
#define ABTAK2    	0x4
#define ABTAK     	0x7

#define CANTBSEL	(*(volatile unsigned char *)(REG_BASE + 0x0000014A))

#define TX0       	0x1
#define TX1       	0x2
#define TX2       	0x4
#define TX        	0x7

#define CANIDAC	(*(volatile unsigned char *)(REG_BASE + 0x0000014B))

#define IDHIT0    	0x1
#define IDHIT1    	0x2
#define IDHIT2    	0x4
#define IDAM0     	0x10
#define IDAM1     	0x20
#define IDHIT     	0x7
#define IDAM      	0x30

#define CANRXERR	(*(volatile unsigned char *)(REG_BASE + 0x0000014E))

#define RXERR0    	0x1
#define RXERR1    	0x2
#define RXERR2    	0x4
#define RXERR3    	0x8
#define RXERR4    	0x10
#define RXERR5    	0x20
#define RXERR6    	0x40
#define RXERR7    	0x80
#define RXERR     	0xff

#define CANTXERR	(*(volatile unsigned char *)(REG_BASE + 0x0000014F))

#define TXERR0    	0x1
#define TXERR1    	0x2
#define TXERR2    	0x4
#define TXERR3    	0x8
#define TXERR4    	0x10
#define TXERR5    	0x20
#define TXERR6    	0x40
#define TXERR7    	0x80
#define TXERR     	0xff

#define CANIDAR0	(*(volatile unsigned char *)(REG_BASE + 0x00000150))

#define AC0       	0x1
#define AC1       	0x2
#define AC2       	0x4
#define AC3       	0x8
#define AC4       	0x10
#define AC5       	0x20
#define AC6       	0x40
#define AC7       	0x80
#define AC        	0xff

#define CANIDAR1	(*(volatile unsigned char *)(REG_BASE + 0x00000151))

/* duplicate resolved by name mangling -- prepend CANIDAR1 */

#define CANIDAR1_AC0	0x1

/* duplicate resolved by name mangling -- prepend CANIDAR1 */
#define CANIDAR1_AC1	0x2

/* duplicate resolved by name mangling -- prepend CANIDAR1 */
#define CANIDAR1_AC2	0x4

/* duplicate resolved by name mangling -- prepend CANIDAR1 */
#define CANIDAR1_AC3	0x8

/* duplicate resolved by name mangling -- prepend CANIDAR1 */
#define CANIDAR1_AC4	0x10

/* duplicate resolved by name mangling -- prepend CANIDAR1 */
#define CANIDAR1_AC5	0x20

/* duplicate resolved by name mangling -- prepend CANIDAR1 */
#define CANIDAR1_AC6	0x40

/* duplicate resolved by name mangling -- prepend CANIDAR1 */
#define CANIDAR1_AC7	0x80

/* duplicate resolved by name mangling -- prepend CANIDAR1 */
#define CANIDAR1_AC	0xff

#define CANIDAR2	(*(volatile unsigned char *)(REG_BASE + 0x00000152))

/* duplicate resolved by name mangling -- prepend CANIDAR2 */

#define CANIDAR2_AC0	0x1

/* duplicate resolved by name mangling -- prepend CANIDAR2 */
#define CANIDAR2_AC1	0x2

/* duplicate resolved by name mangling -- prepend CANIDAR2 */
#define CANIDAR2_AC2	0x4

/* duplicate resolved by name mangling -- prepend CANIDAR2 */
#define CANIDAR2_AC3	0x8

/* duplicate resolved by name mangling -- prepend CANIDAR2 */
#define CANIDAR2_AC4	0x10

/* duplicate resolved by name mangling -- prepend CANIDAR2 */
#define CANIDAR2_AC5	0x20

/* duplicate resolved by name mangling -- prepend CANIDAR2 */
#define CANIDAR2_AC6	0x40

/* duplicate resolved by name mangling -- prepend CANIDAR2 */
#define CANIDAR2_AC7	0x80

/* duplicate resolved by name mangling -- prepend CANIDAR2 */
#define CANIDAR2_AC	0xff

#define CANIDAR3	(*(volatile unsigned char *)(REG_BASE + 0x00000153))

/* duplicate resolved by name mangling -- prepend CANIDAR3 */

#define CANIDAR3_AC0	0x1

/* duplicate resolved by name mangling -- prepend CANIDAR3 */
#define CANIDAR3_AC1	0x2

/* duplicate resolved by name mangling -- prepend CANIDAR3 */
#define CANIDAR3_AC2	0x4

/* duplicate resolved by name mangling -- prepend CANIDAR3 */
#define CANIDAR3_AC3	0x8

/* duplicate resolved by name mangling -- prepend CANIDAR3 */
#define CANIDAR3_AC4	0x10

/* duplicate resolved by name mangling -- prepend CANIDAR3 */
#define CANIDAR3_AC5	0x20

/* duplicate resolved by name mangling -- prepend CANIDAR3 */
#define CANIDAR3_AC6	0x40

/* duplicate resolved by name mangling -- prepend CANIDAR3 */
#define CANIDAR3_AC7	0x80

/* duplicate resolved by name mangling -- prepend CANIDAR3 */
#define CANIDAR3_AC	0xff

#define CANIDMR0	(*(volatile unsigned char *)(REG_BASE + 0x00000154))

#define AM0       	0x1
#define AM1       	0x2
#define AM2       	0x4
#define AM3       	0x8
#define AM4       	0x10
#define AM5       	0x20
#define AM6       	0x40
#define AM7       	0x80
#define AM        	0xff

#define CANIDMR1	(*(volatile unsigned char *)(REG_BASE + 0x00000155))

/* duplicate resolved by name mangling -- prepend CANIDMR1 */

#define CANIDMR1_AM0	0x1

/* duplicate resolved by name mangling -- prepend CANIDMR1 */
#define CANIDMR1_AM1	0x2

/* duplicate resolved by name mangling -- prepend CANIDMR1 */
#define CANIDMR1_AM2	0x4

/* duplicate resolved by name mangling -- prepend CANIDMR1 */
#define CANIDMR1_AM3	0x8

/* duplicate resolved by name mangling -- prepend CANIDMR1 */
#define CANIDMR1_AM4	0x10

/* duplicate resolved by name mangling -- prepend CANIDMR1 */
#define CANIDMR1_AM5	0x20

/* duplicate resolved by name mangling -- prepend CANIDMR1 */
#define CANIDMR1_AM6	0x40

/* duplicate resolved by name mangling -- prepend CANIDMR1 */
#define CANIDMR1_AM7	0x80

/* duplicate resolved by name mangling -- prepend CANIDMR1 */
#define CANIDMR1_AM	0xff

#define CANIDMR2	(*(volatile unsigned char *)(REG_BASE + 0x00000156))

/* duplicate resolved by name mangling -- prepend CANIDMR2 */

#define CANIDMR2_AM0	0x1

/* duplicate resolved by name mangling -- prepend CANIDMR2 */
#define CANIDMR2_AM1	0x2

/* duplicate resolved by name mangling -- prepend CANIDMR2 */
#define CANIDMR2_AM2	0x4

/* duplicate resolved by name mangling -- prepend CANIDMR2 */
#define CANIDMR2_AM3	0x8

/* duplicate resolved by name mangling -- prepend CANIDMR2 */
#define CANIDMR2_AM4	0x10

/* duplicate resolved by name mangling -- prepend CANIDMR2 */
#define CANIDMR2_AM5	0x20

/* duplicate resolved by name mangling -- prepend CANIDMR2 */
#define CANIDMR2_AM6	0x40

/* duplicate resolved by name mangling -- prepend CANIDMR2 */
#define CANIDMR2_AM7	0x80

/* duplicate resolved by name mangling -- prepend CANIDMR2 */
#define CANIDMR2_AM	0xff

#define CANIDMR3	(*(volatile unsigned char *)(REG_BASE + 0x00000157))

/* duplicate resolved by name mangling -- prepend CANIDMR3 */

#define CANIDMR3_AM0	0x1

/* duplicate resolved by name mangling -- prepend CANIDMR3 */
#define CANIDMR3_AM1	0x2

/* duplicate resolved by name mangling -- prepend CANIDMR3 */
#define CANIDMR3_AM2	0x4

/* duplicate resolved by name mangling -- prepend CANIDMR3 */
#define CANIDMR3_AM3	0x8

/* duplicate resolved by name mangling -- prepend CANIDMR3 */
#define CANIDMR3_AM4	0x10

/* duplicate resolved by name mangling -- prepend CANIDMR3 */
#define CANIDMR3_AM5	0x20

/* duplicate resolved by name mangling -- prepend CANIDMR3 */
#define CANIDMR3_AM6	0x40

/* duplicate resolved by name mangling -- prepend CANIDMR3 */
#define CANIDMR3_AM7	0x80

/* duplicate resolved by name mangling -- prepend CANIDMR3 */
#define CANIDMR3_AM	0xff

