dldavis007/dg128_gcc_motion/Embedded/Include/mc9s12dg128_imagecraft_reference.h
#define CANIDAR4	(*(volatile unsigned char *)(REG_BASE + 0x00000158))

/* duplicate resolved by name mangling -- prepend CANIDAR4 */

#define CANIDAR4_AC0	0x1

/* duplicate resolved by name mangling -- prepend CANIDAR4 */
#define CANIDAR4_AC1	0x2

/* duplicate resolved by name mangling -- prepend CANIDAR4 */
#define CANIDAR4_AC2	0x4

/* duplicate resolved by name mangling -- prepend CANIDAR4 */
#define CANIDAR4_AC3	0x8

/* duplicate resolved by name mangling -- prepend CANIDAR4 */
#define CANIDAR4_AC4	0x10

/* duplicate resolved by name mangling -- prepend CANIDAR4 */
#define CANIDAR4_AC5	0x20

/* duplicate resolved by name mangling -- prepend CANIDAR4 */
#define CANIDAR4_AC6	0x40

/* duplicate resolved by name mangling -- prepend CANIDAR4 */
#define CANIDAR4_AC7	0x80

/* duplicate resolved by name mangling -- prepend CANIDAR4 */
#define CANIDAR4_AC	0xff

#define CANIDAR5	(*(volatile unsigned char *)(REG_BASE + 0x00000159))

/* duplicate resolved by name mangling -- prepend CANIDAR5 */

#define CANIDAR5_AC0	0x1

/* duplicate resolved by name mangling -- prepend CANIDAR5 */
#define CANIDAR5_AC1	0x2

/* duplicate resolved by name mangling -- prepend CANIDAR5 */
#define CANIDAR5_AC2	0x4

/* duplicate resolved by name mangling -- prepend CANIDAR5 */
#define CANIDAR5_AC3	0x8

/* duplicate resolved by name mangling -- prepend CANIDAR5 */
#define CANIDAR5_AC4	0x10

/* duplicate resolved by name mangling -- prepend CANIDAR5 */
#define CANIDAR5_AC5	0x20

/* duplicate resolved by name mangling -- prepend CANIDAR5 */
#define CANIDAR5_AC6	0x40

/* duplicate resolved by name mangling -- prepend CANIDAR5 */
#define CANIDAR5_AC7	0x80

/* duplicate resolved by name mangling -- prepend CANIDAR5 */
#define CANIDAR5_AC	0xff

#define CANIDAR6	(*(volatile unsigned char *)(REG_BASE + 0x0000015A))

/* duplicate resolved by name mangling -- prepend CANIDAR6 */

#define CANIDAR6_AC0	0x1

/* duplicate resolved by name mangling -- prepend CANIDAR6 */
#define CANIDAR6_AC1	0x2

/* duplicate resolved by name mangling -- prepend CANIDAR6 */
#define CANIDAR6_AC2	0x4

/* duplicate resolved by name mangling -- prepend CANIDAR6 */
#define CANIDAR6_AC3	0x8

/* duplicate resolved by name mangling -- prepend CANIDAR6 */
#define CANIDAR6_AC4	0x10

/* duplicate resolved by name mangling -- prepend CANIDAR6 */
#define CANIDAR6_AC5	0x20

/* duplicate resolved by name mangling -- prepend CANIDAR6 */
#define CANIDAR6_AC6	0x40

/* duplicate resolved by name mangling -- prepend CANIDAR6 */
#define CANIDAR6_AC7	0x80

/* duplicate resolved by name mangling -- prepend CANIDAR6 */
#define CANIDAR6_AC	0xff

#define CANIDAR7	(*(volatile unsigned char *)(REG_BASE + 0x0000015B))

/* duplicate resolved by name mangling -- prepend CANIDAR7 */

#define CANIDAR7_AC0	0x1

/* duplicate resolved by name mangling -- prepend CANIDAR7 */
#define CANIDAR7_AC1	0x2

/* duplicate resolved by name mangling -- prepend CANIDAR7 */
#define CANIDAR7_AC2	0x4

/* duplicate resolved by name mangling -- prepend CANIDAR7 */
#define CANIDAR7_AC3	0x8

/* duplicate resolved by name mangling -- prepend CANIDAR7 */
#define CANIDAR7_AC4	0x10

/* duplicate resolved by name mangling -- prepend CANIDAR7 */
#define CANIDAR7_AC5	0x20

/* duplicate resolved by name mangling -- prepend CANIDAR7 */
#define CANIDAR7_AC6	0x40

/* duplicate resolved by name mangling -- prepend CANIDAR7 */
#define CANIDAR7_AC7	0x80

/* duplicate resolved by name mangling -- prepend CANIDAR7 */
#define CANIDAR7_AC	0xff

#define CANIDMR4	(*(volatile unsigned char *)(REG_BASE + 0x0000015C))

/* duplicate resolved by name mangling -- prepend CANIDMR4 */

#define CANIDMR4_AM0	0x1

/* duplicate resolved by name mangling -- prepend CANIDMR4 */
#define CANIDMR4_AM1	0x2

/* duplicate resolved by name mangling -- prepend CANIDMR4 */
#define CANIDMR4_AM2	0x4

/* duplicate resolved by name mangling -- prepend CANIDMR4 */
#define CANIDMR4_AM3	0x8

/* duplicate resolved by name mangling -- prepend CANIDMR4 */
#define CANIDMR4_AM4	0x10

/* duplicate resolved by name mangling -- prepend CANIDMR4 */
#define CANIDMR4_AM5	0x20

/* duplicate resolved by name mangling -- prepend CANIDMR4 */
#define CANIDMR4_AM6	0x40

/* duplicate resolved by name mangling -- prepend CANIDMR4 */
#define CANIDMR4_AM7	0x80

/* duplicate resolved by name mangling -- prepend CANIDMR4 */
#define CANIDMR4_AM	0xff

#define CANIDMR5	(*(volatile unsigned char *)(REG_BASE + 0x0000015D))

/* duplicate resolved by name mangling -- prepend CANIDMR5 */

#define CANIDMR5_AM0	0x1

/* duplicate resolved by name mangling -- prepend CANIDMR5 */
#define CANIDMR5_AM1	0x2

/* duplicate resolved by name mangling -- prepend CANIDMR5 */
#define CANIDMR5_AM2	0x4

/* duplicate resolved by name mangling -- prepend CANIDMR5 */
#define CANIDMR5_AM3	0x8

/* duplicate resolved by name mangling -- prepend CANIDMR5 */
#define CANIDMR5_AM4	0x10

/* duplicate resolved by name mangling -- prepend CANIDMR5 */
#define CANIDMR5_AM5	0x20

/* duplicate resolved by name mangling -- prepend CANIDMR5 */
#define CANIDMR5_AM6	0x40

/* duplicate resolved by name mangling -- prepend CANIDMR5 */
#define CANIDMR5_AM7	0x80

/* duplicate resolved by name mangling -- prepend CANIDMR5 */
#define CANIDMR5_AM	0xff

#define CANIDMR6	(*(volatile unsigned char *)(REG_BASE + 0x0000015E))

/* duplicate resolved by name mangling -- prepend CANIDMR6 */

#define CANIDMR6_AM0	0x1

/* duplicate resolved by name mangling -- prepend CANIDMR6 */
#define CANIDMR6_AM1	0x2

/* duplicate resolved by name mangling -- prepend CANIDMR6 */
#define CANIDMR6_AM2	0x4

/* duplicate resolved by name mangling -- prepend CANIDMR6 */
#define CANIDMR6_AM3	0x8

/* duplicate resolved by name mangling -- prepend CANIDMR6 */
#define CANIDMR6_AM4	0x10

/* duplicate resolved by name mangling -- prepend CANIDMR6 */
#define CANIDMR6_AM5	0x20

/* duplicate resolved by name mangling -- prepend CANIDMR6 */
#define CANIDMR6_AM6	0x40

/* duplicate resolved by name mangling -- prepend CANIDMR6 */
#define CANIDMR6_AM7	0x80

/* duplicate resolved by name mangling -- prepend CANIDMR6 */
#define CANIDMR6_AM	0xff

