dldavis007/dg128_gcc_motion/Embedded/Include/mc9s12dg128_imagecraft_reference.h
#define CANIDMR7	(*(volatile unsigned char *)(REG_BASE + 0x0000015F))

/* duplicate resolved by name mangling -- prepend CANIDMR7 */

#define CANIDMR7_AM0	0x1

/* duplicate resolved by name mangling -- prepend CANIDMR7 */
#define CANIDMR7_AM1	0x2

/* duplicate resolved by name mangling -- prepend CANIDMR7 */
#define CANIDMR7_AM2	0x4

/* duplicate resolved by name mangling -- prepend CANIDMR7 */
#define CANIDMR7_AM3	0x8

/* duplicate resolved by name mangling -- prepend CANIDMR7 */
#define CANIDMR7_AM4	0x10

/* duplicate resolved by name mangling -- prepend CANIDMR7 */
#define CANIDMR7_AM5	0x20

/* duplicate resolved by name mangling -- prepend CANIDMR7 */
#define CANIDMR7_AM6	0x40

/* duplicate resolved by name mangling -- prepend CANIDMR7 */
#define CANIDMR7_AM7	0x80

/* duplicate resolved by name mangling -- prepend CANIDMR7 */
#define CANIDMR7_AM	0xff

#define CANRXIDR0	(*(volatile unsigned char *)(REG_BASE + 0x00000160))

#define ID21      	0x1
#define ID22      	0x2
#define ID23      	0x4
#define ID24      	0x8
#define ID25      	0x10
#define ID26      	0x20
#define ID27      	0x40
#define ID28      	0x80
#define ID_21     	0xff

#define CANRXIDR1	(*(volatile unsigned char *)(REG_BASE + 0x00000161))

/* duplicate resolved by name mangling -- prepend CANRXIDR1 */

#define CANRXIDR1_ID15	0x1
#define ID16      	0x2
#define ID17      	0x4
#define IDE       	0x8
#define SRR       	0x10
#define ID18      	0x20
#define ID19      	0x40
#define ID20      	0x80
#define ID_15     	0x7
#define ID_18     	0xe0

#define CANRXIDR2	(*(volatile unsigned char *)(REG_BASE + 0x00000162))

/* duplicate resolved by name mangling -- prepend CANRXIDR2 */

#define CANRXIDR2_ID7	0x1

/* duplicate resolved by name mangling -- prepend CANRXIDR2 */
#define CANRXIDR2_ID8	0x2

/* duplicate resolved by name mangling -- prepend CANRXIDR2 */
#define CANRXIDR2_ID9	0x4

/* duplicate resolved by name mangling -- prepend CANRXIDR2 */
#define CANRXIDR2_ID10	0x8

/* duplicate resolved by name mangling -- prepend CANRXIDR2 */
#define CANRXIDR2_ID11	0x10

/* duplicate resolved by name mangling -- prepend CANRXIDR2 */
#define CANRXIDR2_ID12	0x20

/* duplicate resolved by name mangling -- prepend CANRXIDR2 */
#define CANRXIDR2_ID13	0x40

/* duplicate resolved by name mangling -- prepend CANRXIDR2 */
#define CANRXIDR2_ID14	0x80
#define ID_7      	0xff

#define CANRXIDR3	(*(volatile unsigned char *)(REG_BASE + 0x00000163))

/* duplicate resolved by name mangling -- prepend CANRXIDR3 */

#define CANRXIDR3_RTR	0x1

/* duplicate resolved by name mangling -- prepend CANRXIDR3 */
#define CANRXIDR3_ID0	0x2

/* duplicate resolved by name mangling -- prepend CANRXIDR3 */
#define CANRXIDR3_ID1	0x4

/* duplicate resolved by name mangling -- prepend CANRXIDR3 */
#define CANRXIDR3_ID2	0x8

/* duplicate resolved by name mangling -- prepend CANRXIDR3 */
#define CANRXIDR3_ID3	0x10

/* duplicate resolved by name mangling -- prepend CANRXIDR3 */
#define CANRXIDR3_ID4	0x20

/* duplicate resolved by name mangling -- prepend CANRXIDR3 */
#define CANRXIDR3_ID5	0x40

/* duplicate resolved by name mangling -- prepend CANRXIDR3 */
#define CANRXIDR3_ID6	0x80

/* duplicate resolved by name mangling -- prepend CANRXIDR3 */
#define CANRXIDR3_ID	0xfe

#define CANRXDSR0	(*(volatile unsigned char *)(REG_BASE + 0x00000164))

#define DB0       	0x1
#define DB1       	0x2
#define DB2       	0x4
#define DB3       	0x8
#define DB4       	0x10
#define DB5       	0x20
#define DB6       	0x40
#define DB7       	0x80
#define DB        	0xff

#define CANRXDSR1	(*(volatile unsigned char *)(REG_BASE + 0x00000165))

/* duplicate resolved by name mangling -- prepend CANRXDSR1 */

#define CANRXDSR1_DB0	0x1

/* duplicate resolved by name mangling -- prepend CANRXDSR1 */
#define CANRXDSR1_DB1	0x2

/* duplicate resolved by name mangling -- prepend CANRXDSR1 */
#define CANRXDSR1_DB2	0x4

/* duplicate resolved by name mangling -- prepend CANRXDSR1 */
#define CANRXDSR1_DB3	0x8

/* duplicate resolved by name mangling -- prepend CANRXDSR1 */
#define CANRXDSR1_DB4	0x10

/* duplicate resolved by name mangling -- prepend CANRXDSR1 */
#define CANRXDSR1_DB5	0x20

/* duplicate resolved by name mangling -- prepend CANRXDSR1 */
#define CANRXDSR1_DB6	0x40

/* duplicate resolved by name mangling -- prepend CANRXDSR1 */
#define CANRXDSR1_DB7	0x80

/* duplicate resolved by name mangling -- prepend CANRXDSR1 */
#define CANRXDSR1_DB	0xff

#define CANRXDSR2	(*(volatile unsigned char *)(REG_BASE + 0x00000166))

/* duplicate resolved by name mangling -- prepend CANRXDSR2 */

#define CANRXDSR2_DB0	0x1

/* duplicate resolved by name mangling -- prepend CANRXDSR2 */
#define CANRXDSR2_DB1	0x2

/* duplicate resolved by name mangling -- prepend CANRXDSR2 */
#define CANRXDSR2_DB2	0x4

/* duplicate resolved by name mangling -- prepend CANRXDSR2 */
#define CANRXDSR2_DB3	0x8

/* duplicate resolved by name mangling -- prepend CANRXDSR2 */
#define CANRXDSR2_DB4	0x10

/* duplicate resolved by name mangling -- prepend CANRXDSR2 */
#define CANRXDSR2_DB5	0x20

/* duplicate resolved by name mangling -- prepend CANRXDSR2 */
#define CANRXDSR2_DB6	0x40

/* duplicate resolved by name mangling -- prepend CANRXDSR2 */
#define CANRXDSR2_DB7	0x80

/* duplicate resolved by name mangling -- prepend CANRXDSR2 */
#define CANRXDSR2_DB	0xff

#define CANRXDSR3	(*(volatile unsigned char *)(REG_BASE + 0x00000167))

/* duplicate resolved by name mangling -- prepend CANRXDSR3 */

#define CANRXDSR3_DB0	0x1

/* duplicate resolved by name mangling -- prepend CANRXDSR3 */
#define CANRXDSR3_DB1	0x2

/* duplicate resolved by name mangling -- prepend CANRXDSR3 */
#define CANRXDSR3_DB2	0x4

/* duplicate resolved by name mangling -- prepend CANRXDSR3 */
#define CANRXDSR3_DB3	0x8

/* duplicate resolved by name mangling -- prepend CANRXDSR3 */
#define CANRXDSR3_DB4	0x10

/* duplicate resolved by name mangling -- prepend CANRXDSR3 */
#define CANRXDSR3_DB5	0x20

/* duplicate resolved by name mangling -- prepend CANRXDSR3 */
#define CANRXDSR3_DB6	0x40

