dldavis007/dg128_gcc_motion/Embedded/Include/mc9s12dg128_imagecraft_reference.h
/* duplicate resolved by name mangling -- prepend CANRXDSR3 */
#define CANRXDSR3_DB7	0x80

/* duplicate resolved by name mangling -- prepend CANRXDSR3 */
#define CANRXDSR3_DB	0xff

#define CANRXDSR4	(*(volatile unsigned char *)(REG_BASE + 0x00000168))

/* duplicate resolved by name mangling -- prepend CANRXDSR4 */

#define CANRXDSR4_DB0	0x1

/* duplicate resolved by name mangling -- prepend CANRXDSR4 */
#define CANRXDSR4_DB1	0x2

/* duplicate resolved by name mangling -- prepend CANRXDSR4 */
#define CANRXDSR4_DB2	0x4

/* duplicate resolved by name mangling -- prepend CANRXDSR4 */
#define CANRXDSR4_DB3	0x8

/* duplicate resolved by name mangling -- prepend CANRXDSR4 */
#define CANRXDSR4_DB4	0x10

/* duplicate resolved by name mangling -- prepend CANRXDSR4 */
#define CANRXDSR4_DB5	0x20

/* duplicate resolved by name mangling -- prepend CANRXDSR4 */
#define CANRXDSR4_DB6	0x40

/* duplicate resolved by name mangling -- prepend CANRXDSR4 */
#define CANRXDSR4_DB7	0x80

/* duplicate resolved by name mangling -- prepend CANRXDSR4 */
#define CANRXDSR4_DB	0xff

#define CANRXDSR5	(*(volatile unsigned char *)(REG_BASE + 0x00000169))

/* duplicate resolved by name mangling -- prepend CANRXDSR5 */

#define CANRXDSR5_DB0	0x1

/* duplicate resolved by name mangling -- prepend CANRXDSR5 */
#define CANRXDSR5_DB1	0x2

/* duplicate resolved by name mangling -- prepend CANRXDSR5 */
#define CANRXDSR5_DB2	0x4

/* duplicate resolved by name mangling -- prepend CANRXDSR5 */
#define CANRXDSR5_DB3	0x8

/* duplicate resolved by name mangling -- prepend CANRXDSR5 */
#define CANRXDSR5_DB4	0x10

/* duplicate resolved by name mangling -- prepend CANRXDSR5 */
#define CANRXDSR5_DB5	0x20

/* duplicate resolved by name mangling -- prepend CANRXDSR5 */
#define CANRXDSR5_DB6	0x40

/* duplicate resolved by name mangling -- prepend CANRXDSR5 */
#define CANRXDSR5_DB7	0x80

/* duplicate resolved by name mangling -- prepend CANRXDSR5 */
#define CANRXDSR5_DB	0xff

#define CANRXDSR6	(*(volatile unsigned char *)(REG_BASE + 0x0000016A))

/* duplicate resolved by name mangling -- prepend CANRXDSR6 */

#define CANRXDSR6_DB0	0x1

/* duplicate resolved by name mangling -- prepend CANRXDSR6 */
#define CANRXDSR6_DB1	0x2

/* duplicate resolved by name mangling -- prepend CANRXDSR6 */
#define CANRXDSR6_DB2	0x4

/* duplicate resolved by name mangling -- prepend CANRXDSR6 */
#define CANRXDSR6_DB3	0x8

/* duplicate resolved by name mangling -- prepend CANRXDSR6 */
#define CANRXDSR6_DB4	0x10

/* duplicate resolved by name mangling -- prepend CANRXDSR6 */
#define CANRXDSR6_DB5	0x20

/* duplicate resolved by name mangling -- prepend CANRXDSR6 */
#define CANRXDSR6_DB6	0x40

/* duplicate resolved by name mangling -- prepend CANRXDSR6 */
#define CANRXDSR6_DB7	0x80

/* duplicate resolved by name mangling -- prepend CANRXDSR6 */
#define CANRXDSR6_DB	0xff

#define CANRXDSR7	(*(volatile unsigned char *)(REG_BASE + 0x0000016B))

/* duplicate resolved by name mangling -- prepend CANRXDSR7 */

#define CANRXDSR7_DB0	0x1

/* duplicate resolved by name mangling -- prepend CANRXDSR7 */
#define CANRXDSR7_DB1	0x2

/* duplicate resolved by name mangling -- prepend CANRXDSR7 */
#define CANRXDSR7_DB2	0x4

/* duplicate resolved by name mangling -- prepend CANRXDSR7 */
#define CANRXDSR7_DB3	0x8

/* duplicate resolved by name mangling -- prepend CANRXDSR7 */
#define CANRXDSR7_DB4	0x10

/* duplicate resolved by name mangling -- prepend CANRXDSR7 */
#define CANRXDSR7_DB5	0x20

/* duplicate resolved by name mangling -- prepend CANRXDSR7 */
#define CANRXDSR7_DB6	0x40

/* duplicate resolved by name mangling -- prepend CANRXDSR7 */
#define CANRXDSR7_DB7	0x80

/* duplicate resolved by name mangling -- prepend CANRXDSR7 */
#define CANRXDSR7_DB	0xff

#define CANRXDLR	(*(volatile unsigned char *)(REG_BASE + 0x0000016C))

#define DLC0      	0x1
#define DLC1      	0x2
#define DLC2      	0x4
#define DLC3      	0x8
#define DLC       	0xf

#define CANTXIDR0	(*(volatile unsigned char *)(REG_BASE + 0x00000170))

/* duplicate resolved by name mangling -- prepend CANTXIDR0 */

#define CANTXIDR0_ID21	0x1

/* duplicate resolved by name mangling -- prepend CANTXIDR0 */
#define CANTXIDR0_ID22	0x2

/* duplicate resolved by name mangling -- prepend CANTXIDR0 */
#define CANTXIDR0_ID23	0x4

/* duplicate resolved by name mangling -- prepend CANTXIDR0 */
#define CANTXIDR0_ID24	0x8

/* duplicate resolved by name mangling -- prepend CANTXIDR0 */
#define CANTXIDR0_ID25	0x10

/* duplicate resolved by name mangling -- prepend CANTXIDR0 */
#define CANTXIDR0_ID26	0x20

/* duplicate resolved by name mangling -- prepend CANTXIDR0 */
#define CANTXIDR0_ID27	0x40

/* duplicate resolved by name mangling -- prepend CANTXIDR0 */
#define CANTXIDR0_ID28	0x80

/* duplicate resolved by name mangling -- prepend CANTXIDR0 */
#define CANTXIDR0_ID_21	0xff

#define CANTXIDR1	(*(volatile unsigned char *)(REG_BASE + 0x00000171))

/* duplicate resolved by name mangling -- prepend CANTXIDR1 */

#define CANTXIDR1_ID15	0x1

/* duplicate resolved by name mangling -- prepend CANTXIDR1 */
#define CANTXIDR1_ID16	0x2

/* duplicate resolved by name mangling -- prepend CANTXIDR1 */
#define CANTXIDR1_ID17	0x4

/* duplicate resolved by name mangling -- prepend CANTXIDR1 */
#define CANTXIDR1_IDE	0x8

/* duplicate resolved by name mangling -- prepend CANTXIDR1 */
#define CANTXIDR1_SRR	0x10

/* duplicate resolved by name mangling -- prepend CANTXIDR1 */
#define CANTXIDR1_ID18	0x20

/* duplicate resolved by name mangling -- prepend CANTXIDR1 */
#define CANTXIDR1_ID19	0x40

/* duplicate resolved by name mangling -- prepend CANTXIDR1 */
#define CANTXIDR1_ID20	0x80

/* duplicate resolved by name mangling -- prepend CANTXIDR1 */
#define CANTXIDR1_ID_15	0x7

/* duplicate resolved by name mangling -- prepend CANTXIDR1 */
#define CANTXIDR1_ID_18	0xe0

#define CANTXIDR2	(*(volatile unsigned char *)(REG_BASE + 0x00000172))

/* duplicate resolved by name mangling -- prepend CANTXIDR2 */

#define CANTXIDR2_ID7	0x1

/* duplicate resolved by name mangling -- prepend CANTXIDR2 */
#define CANTXIDR2_ID8	0x2

