dldavis007/dg128_gcc_motion/Embedded/Include/mc9s12dg128_imagecraft_reference.h
/* duplicate resolved by name mangling -- prepend CANTXIDR2 */
#define CANTXIDR2_ID9	0x4

/* duplicate resolved by name mangling -- prepend CANTXIDR2 */
#define CANTXIDR2_ID10	0x8

/* duplicate resolved by name mangling -- prepend CANTXIDR2 */
#define CANTXIDR2_ID11	0x10

/* duplicate resolved by name mangling -- prepend CANTXIDR2 */
#define CANTXIDR2_ID12	0x20

/* duplicate resolved by name mangling -- prepend CANTXIDR2 */
#define CANTXIDR2_ID13	0x40

/* duplicate resolved by name mangling -- prepend CANTXIDR2 */
#define CANTXIDR2_ID14	0x80

/* duplicate resolved by name mangling -- prepend CANTXIDR2 */
#define CANTXIDR2_ID_7	0xff

#define CANTXIDR3	(*(volatile unsigned char *)(REG_BASE + 0x00000173))

/* duplicate resolved by name mangling -- prepend CANTXIDR3 */

#define CANTXIDR3_RTR	0x1

/* duplicate resolved by name mangling -- prepend CANTXIDR3 */
#define CANTXIDR3_ID0	0x2

/* duplicate resolved by name mangling -- prepend CANTXIDR3 */
#define CANTXIDR3_ID1	0x4

/* duplicate resolved by name mangling -- prepend CANTXIDR3 */
#define CANTXIDR3_ID2	0x8

/* duplicate resolved by name mangling -- prepend CANTXIDR3 */
#define CANTXIDR3_ID3	0x10

/* duplicate resolved by name mangling -- prepend CANTXIDR3 */
#define CANTXIDR3_ID4	0x20

/* duplicate resolved by name mangling -- prepend CANTXIDR3 */
#define CANTXIDR3_ID5	0x40

/* duplicate resolved by name mangling -- prepend CANTXIDR3 */
#define CANTXIDR3_ID6	0x80

/* duplicate resolved by name mangling -- prepend CANTXIDR3 */
#define CANTXIDR3_ID	0xfe

#define CANTXDSR0	(*(volatile unsigned char *)(REG_BASE + 0x00000174))

/* duplicate resolved by name mangling -- prepend CANTXDSR0 */

#define CANTXDSR0_DB0	0x1

/* duplicate resolved by name mangling -- prepend CANTXDSR0 */
#define CANTXDSR0_DB1	0x2

/* duplicate resolved by name mangling -- prepend CANTXDSR0 */
#define CANTXDSR0_DB2	0x4

/* duplicate resolved by name mangling -- prepend CANTXDSR0 */
#define CANTXDSR0_DB3	0x8

/* duplicate resolved by name mangling -- prepend CANTXDSR0 */
#define CANTXDSR0_DB4	0x10

/* duplicate resolved by name mangling -- prepend CANTXDSR0 */
#define CANTXDSR0_DB5	0x20

/* duplicate resolved by name mangling -- prepend CANTXDSR0 */
#define CANTXDSR0_DB6	0x40

/* duplicate resolved by name mangling -- prepend CANTXDSR0 */
#define CANTXDSR0_DB7	0x80

/* duplicate resolved by name mangling -- prepend CANTXDSR0 */
#define CANTXDSR0_DB	0xff

#define CANTXDSR1	(*(volatile unsigned char *)(REG_BASE + 0x00000175))

/* duplicate resolved by name mangling -- prepend CANTXDSR1 */

#define CANTXDSR1_DB0	0x1

/* duplicate resolved by name mangling -- prepend CANTXDSR1 */
#define CANTXDSR1_DB1	0x2

/* duplicate resolved by name mangling -- prepend CANTXDSR1 */
#define CANTXDSR1_DB2	0x4

/* duplicate resolved by name mangling -- prepend CANTXDSR1 */
#define CANTXDSR1_DB3	0x8

/* duplicate resolved by name mangling -- prepend CANTXDSR1 */
#define CANTXDSR1_DB4	0x10

/* duplicate resolved by name mangling -- prepend CANTXDSR1 */
#define CANTXDSR1_DB5	0x20

/* duplicate resolved by name mangling -- prepend CANTXDSR1 */
#define CANTXDSR1_DB6	0x40

/* duplicate resolved by name mangling -- prepend CANTXDSR1 */
#define CANTXDSR1_DB7	0x80

/* duplicate resolved by name mangling -- prepend CANTXDSR1 */
#define CANTXDSR1_DB	0xff

#define CANTXDSR2	(*(volatile unsigned char *)(REG_BASE + 0x00000176))

/* duplicate resolved by name mangling -- prepend CANTXDSR2 */

#define CANTXDSR2_DB0	0x1

/* duplicate resolved by name mangling -- prepend CANTXDSR2 */
#define CANTXDSR2_DB1	0x2

/* duplicate resolved by name mangling -- prepend CANTXDSR2 */
#define CANTXDSR2_DB2	0x4

/* duplicate resolved by name mangling -- prepend CANTXDSR2 */
#define CANTXDSR2_DB3	0x8

/* duplicate resolved by name mangling -- prepend CANTXDSR2 */
#define CANTXDSR2_DB4	0x10

/* duplicate resolved by name mangling -- prepend CANTXDSR2 */
#define CANTXDSR2_DB5	0x20

/* duplicate resolved by name mangling -- prepend CANTXDSR2 */
#define CANTXDSR2_DB6	0x40

/* duplicate resolved by name mangling -- prepend CANTXDSR2 */
#define CANTXDSR2_DB7	0x80

/* duplicate resolved by name mangling -- prepend CANTXDSR2 */
#define CANTXDSR2_DB	0xff

#define CANTXDSR3	(*(volatile unsigned char *)(REG_BASE + 0x00000177))

/* duplicate resolved by name mangling -- prepend CANTXDSR3 */

#define CANTXDSR3_DB0	0x1

/* duplicate resolved by name mangling -- prepend CANTXDSR3 */
#define CANTXDSR3_DB1	0x2

/* duplicate resolved by name mangling -- prepend CANTXDSR3 */
#define CANTXDSR3_DB2	0x4

/* duplicate resolved by name mangling -- prepend CANTXDSR3 */
#define CANTXDSR3_DB3	0x8

/* duplicate resolved by name mangling -- prepend CANTXDSR3 */
#define CANTXDSR3_DB4	0x10

/* duplicate resolved by name mangling -- prepend CANTXDSR3 */
#define CANTXDSR3_DB5	0x20

/* duplicate resolved by name mangling -- prepend CANTXDSR3 */
#define CANTXDSR3_DB6	0x40

/* duplicate resolved by name mangling -- prepend CANTXDSR3 */
#define CANTXDSR3_DB7	0x80

/* duplicate resolved by name mangling -- prepend CANTXDSR3 */
#define CANTXDSR3_DB	0xff

#define CANTXDSR4	(*(volatile unsigned char *)(REG_BASE + 0x00000178))

/* duplicate resolved by name mangling -- prepend CANTXDSR4 */

#define CANTXDSR4_DB0	0x1

/* duplicate resolved by name mangling -- prepend CANTXDSR4 */
#define CANTXDSR4_DB1	0x2

/* duplicate resolved by name mangling -- prepend CANTXDSR4 */
#define CANTXDSR4_DB2	0x4

/* duplicate resolved by name mangling -- prepend CANTXDSR4 */
#define CANTXDSR4_DB3	0x8

/* duplicate resolved by name mangling -- prepend CANTXDSR4 */
#define CANTXDSR4_DB4	0x10

/* duplicate resolved by name mangling -- prepend CANTXDSR4 */
#define CANTXDSR4_DB5	0x20

/* duplicate resolved by name mangling -- prepend CANTXDSR4 */
#define CANTXDSR4_DB6	0x40

/* duplicate resolved by name mangling -- prepend CANTXDSR4 */
#define CANTXDSR4_DB7	0x80

/* duplicate resolved by name mangling -- prepend CANTXDSR4 */
#define CANTXDSR4_DB	0xff

#define CANTXDSR5	(*(volatile unsigned char *)(REG_BASE + 0x00000179))

/* duplicate resolved by name mangling -- prepend CANTXDSR5 */

#define CANTXDSR5_DB0	0x1

/* duplicate resolved by name mangling -- prepend CANTXDSR5 */
#define CANTXDSR5_DB1	0x2

/* duplicate resolved by name mangling -- prepend CANTXDSR5 */
#define CANTXDSR5_DB2	0x4

/* duplicate resolved by name mangling -- prepend CANTXDSR5 */
#define CANTXDSR5_DB3	0x8

/* duplicate resolved by name mangling -- prepend CANTXDSR5 */
#define CANTXDSR5_DB4	0x10

/* duplicate resolved by name mangling -- prepend CANTXDSR5 */
#define CANTXDSR5_DB5	0x20

/* duplicate resolved by name mangling -- prepend CANTXDSR5 */
#define CANTXDSR5_DB6	0x40

/* duplicate resolved by name mangling -- prepend CANTXDSR5 */
#define CANTXDSR5_DB7	0x80

/* duplicate resolved by name mangling -- prepend CANTXDSR5 */
#define CANTXDSR5_DB	0xff

#define CANTXDSR6	(*(volatile unsigned char *)(REG_BASE + 0x0000017A))

