dldavis007/dg128_gcc_motion/Embedded/Include/mc9s12dg128_imagecraft_reference.h
/* duplicate resolved by name mangling -- prepend CANTXDSR6 */

#define CANTXDSR6_DB0	0x1

/* duplicate resolved by name mangling -- prepend CANTXDSR6 */
#define CANTXDSR6_DB1	0x2

/* duplicate resolved by name mangling -- prepend CANTXDSR6 */
#define CANTXDSR6_DB2	0x4

/* duplicate resolved by name mangling -- prepend CANTXDSR6 */
#define CANTXDSR6_DB3	0x8

/* duplicate resolved by name mangling -- prepend CANTXDSR6 */
#define CANTXDSR6_DB4	0x10

/* duplicate resolved by name mangling -- prepend CANTXDSR6 */
#define CANTXDSR6_DB5	0x20

/* duplicate resolved by name mangling -- prepend CANTXDSR6 */
#define CANTXDSR6_DB6	0x40

/* duplicate resolved by name mangling -- prepend CANTXDSR6 */
#define CANTXDSR6_DB7	0x80

/* duplicate resolved by name mangling -- prepend CANTXDSR6 */
#define CANTXDSR6_DB	0xff

#define CANTXDSR7	(*(volatile unsigned char *)(REG_BASE + 0x0000017B))

/* duplicate resolved by name mangling -- prepend CANTXDSR7 */

#define CANTXDSR7_DB0	0x1

/* duplicate resolved by name mangling -- prepend CANTXDSR7 */
#define CANTXDSR7_DB1	0x2

/* duplicate resolved by name mangling -- prepend CANTXDSR7 */
#define CANTXDSR7_DB2	0x4

/* duplicate resolved by name mangling -- prepend CANTXDSR7 */
#define CANTXDSR7_DB3	0x8

/* duplicate resolved by name mangling -- prepend CANTXDSR7 */
#define CANTXDSR7_DB4	0x10

/* duplicate resolved by name mangling -- prepend CANTXDSR7 */
#define CANTXDSR7_DB5	0x20

/* duplicate resolved by name mangling -- prepend CANTXDSR7 */
#define CANTXDSR7_DB6	0x40

/* duplicate resolved by name mangling -- prepend CANTXDSR7 */
#define CANTXDSR7_DB7	0x80

/* duplicate resolved by name mangling -- prepend CANTXDSR7 */
#define CANTXDSR7_DB	0xff

#define CANTXDLR	(*(volatile unsigned char *)(REG_BASE + 0x0000017C))

/* duplicate resolved by name mangling -- prepend CANTXDLR */

#define CANTXDLR_DLC0	0x1

/* duplicate resolved by name mangling -- prepend CANTXDLR */
#define CANTXDLR_DLC1	0x2

/* duplicate resolved by name mangling -- prepend CANTXDLR */
#define CANTXDLR_DLC2	0x4

/* duplicate resolved by name mangling -- prepend CANTXDLR */
#define CANTXDLR_DLC3	0x8

/* duplicate resolved by name mangling -- prepend CANTXDLR */
#define CANTXDLR_DLC	0xf

#define CANTXTBPR	(*(volatile unsigned char *)(REG_BASE + 0x0000017F))

#define PRIO0     	0x1
#define PRIO1     	0x2
#define PRIO2     	0x4
#define PRIO3     	0x8
#define PRIO4     	0x10
#define PRIO5     	0x20
#define PRIO6     	0x40
#define PRIO7     	0x80
#define PRIO      	0xff

#define PTT	(*(volatile unsigned char *)(REG_BASE + 0x00000240))

#define PTT0      	0x1
#define PTT1      	0x2
#define PTT2      	0x4
#define PTT3      	0x8
#define PTT4      	0x10
#define PTT5      	0x20
#define PTT6      	0x40
#define PTT7      	0x80

/* duplicate resolved by name mangling -- prepend PTT */
#define PTT_PTT   	0xff

#define PTIT	(*(volatile unsigned char *)(REG_BASE + 0x00000241))

#define PTIT0     	0x1
#define PTIT1     	0x2
#define PTIT2     	0x4
#define PTIT3     	0x8
#define PTIT4     	0x10
#define PTIT5     	0x20
#define PTIT6     	0x40
#define PTIT7     	0x80

/* duplicate resolved by name mangling -- prepend PTIT */
#define PTIT_PTIT 	0xff

#define DDRT	(*(volatile unsigned char *)(REG_BASE + 0x00000242))

#define DDRT0     	0x1
#define DDRT1     	0x2
#define DDRT2     	0x4
#define DDRT3     	0x8
#define DDRT4     	0x10
#define DDRT5     	0x20
#define DDRT6     	0x40
#define DDRT7     	0x80

/* duplicate resolved by name mangling -- prepend DDRT */
#define DDRT_DDRT 	0xff

#define RDRT	(*(volatile unsigned char *)(REG_BASE + 0x00000243))

#define RDRT0     	0x1
#define RDRT1     	0x2
#define RDRT2     	0x4
#define RDRT3     	0x8
#define RDRT4     	0x10
#define RDRT5     	0x20
#define RDRT6     	0x40
#define RDRT7     	0x80

/* duplicate resolved by name mangling -- prepend RDRT */
#define RDRT_RDRT 	0xff

#define PERT	(*(volatile unsigned char *)(REG_BASE + 0x00000244))

#define PERT0     	0x1
#define PERT1     	0x2
#define PERT2     	0x4
#define PERT3     	0x8
#define PERT4     	0x10
#define PERT5     	0x20
#define PERT6     	0x40
#define PERT7     	0x80

/* duplicate resolved by name mangling -- prepend PERT */
#define PERT_PERT 	0xff

#define PPST	(*(volatile unsigned char *)(REG_BASE + 0x00000245))

#define PPST0     	0x1
#define PPST1     	0x2
#define PPST2     	0x4
#define PPST3     	0x8
#define PPST4     	0x10
#define PPST5     	0x20
#define PPST6     	0x40
#define PPST7     	0x80

/* duplicate resolved by name mangling -- prepend PPST */
#define PPST_PPST 	0xff

#define PTS	(*(volatile unsigned char *)(REG_BASE + 0x00000248))

#define PTS0      	0x1
#define PTS1      	0x2
#define PTS2      	0x4
#define PTS3      	0x8
#define PTS4      	0x10
#define PTS5      	0x20
#define PTS6      	0x40
#define PTS7      	0x80

/* duplicate resolved by name mangling -- prepend PTS */
#define PTS_PTS   	0xff

#define PTIS	(*(volatile unsigned char *)(REG_BASE + 0x00000249))

#define PTIS0     	0x1
#define PTIS1     	0x2
#define PTIS2     	0x4
#define PTIS3     	0x8
#define PTIS4     	0x10
#define PTIS5     	0x20
#define PTIS6     	0x40
#define PTIS7     	0x80

/* duplicate resolved by name mangling -- prepend PTIS */
#define PTIS_PTIS 	0xff

#define DDRS	(*(volatile unsigned char *)(REG_BASE + 0x0000024A))

#define DDRS0     	0x1
#define DDRS1     	0x2
#define DDRS2     	0x4
#define DDRS3     	0x8
#define DDRS4     	0x10
#define DDRS5     	0x20
#define DDRS6     	0x40
#define DDRS7     	0x80

/* duplicate resolved by name mangling -- prepend DDRS */
#define DDRS_DDRS 	0xff

#define RDRS	(*(volatile unsigned char *)(REG_BASE + 0x0000024B))

#define RDRS0     	0x1
#define RDRS1     	0x2
#define RDRS2     	0x4
#define RDRS3     	0x8
#define RDRS4     	0x10
#define RDRS5     	0x20
#define RDRS6     	0x40
#define RDRS7     	0x80

/* duplicate resolved by name mangling -- prepend RDRS */
#define RDRS_RDRS 	0xff

#define PERS	(*(volatile unsigned char *)(REG_BASE + 0x0000024C))

#define PERS0     	0x1
#define PERS1     	0x2
#define PERS2     	0x4
#define PERS3     	0x8
#define PERS4     	0x10
#define PERS5     	0x20
#define PERS6     	0x40
#define PERS7     	0x80

/* duplicate resolved by name mangling -- prepend PERS */
#define PERS_PERS 	0xff

#define PPSS	(*(volatile unsigned char *)(REG_BASE + 0x0000024D))

#define PPSS0     	0x1
#define PPSS1     	0x2
#define PPSS2     	0x4
#define PPSS3     	0x8
#define PPSS4     	0x10
#define PPSS5     	0x20
#define PPSS6     	0x40
#define PPSS7     	0x80

/* duplicate resolved by name mangling -- prepend PPSS */
#define PPSS_PPSS 	0xff

