dldavis007/dg128_gcc_motion/Embedded/Include/mc9s12dg128_imagecraft_reference.h
#define WOMS	(*(volatile unsigned char *)(REG_BASE + 0x0000024E))

#define WOMS0     	0x1
#define WOMS1     	0x2
#define WOMS2     	0x4
#define WOMS3     	0x8
#define WOMS4     	0x10
#define WOMS5     	0x20
#define WOMS6     	0x40
#define WOMS7     	0x80

/* duplicate resolved by name mangling -- prepend WOMS */
#define WOMS_WOMS 	0xff

#define PTM	(*(volatile unsigned char *)(REG_BASE + 0x00000250))

#define PTM0      	0x1
#define PTM1      	0x2
#define PTM2      	0x4
#define PTM3      	0x8
#define PTM4      	0x10
#define PTM5      	0x20
#define PTM6      	0x40
#define PTM7      	0x80

/* duplicate resolved by name mangling -- prepend PTM */
#define PTM_PTM   	0xff

#define PTIM	(*(volatile unsigned char *)(REG_BASE + 0x00000251))

#define PTIM0     	0x1
#define PTIM1     	0x2
#define PTIM2     	0x4
#define PTIM3     	0x8
#define PTIM4     	0x10
#define PTIM5     	0x20
#define PTIM6     	0x40
#define PTIM7     	0x80

/* duplicate resolved by name mangling -- prepend PTIM */
#define PTIM_PTIM 	0xff

#define DDRM	(*(volatile unsigned char *)(REG_BASE + 0x00000252))

#define DDRM0     	0x1
#define DDRM1     	0x2
#define DDRM2     	0x4
#define DDRM3     	0x8
#define DDRM4     	0x10
#define DDRM5     	0x20
#define DDRM6     	0x40
#define DDRM7     	0x80

/* duplicate resolved by name mangling -- prepend DDRM */
#define DDRM_DDRM 	0xff

#define RDRM	(*(volatile unsigned char *)(REG_BASE + 0x00000253))

#define RDRM0     	0x1
#define RDRM1     	0x2
#define RDRM2     	0x4
#define RDRM3     	0x8
#define RDRM4     	0x10
#define RDRM5     	0x20
#define RDRM6     	0x40
#define RDRM7     	0x80

/* duplicate resolved by name mangling -- prepend RDRM */
#define RDRM_RDRM 	0xff

#define PERM	(*(volatile unsigned char *)(REG_BASE + 0x00000254))

#define PERM0     	0x1
#define PERM1     	0x2
#define PERM2     	0x4
#define PERM3     	0x8
#define PERM4     	0x10
#define PERM5     	0x20
#define PERM6     	0x40
#define PERM7     	0x80

/* duplicate resolved by name mangling -- prepend PERM */
#define PERM_PERM 	0xff

#define PPSM	(*(volatile unsigned char *)(REG_BASE + 0x00000255))

#define PPSM0     	0x1
#define PPSM1     	0x2
#define PPSM2     	0x4
#define PPSM3     	0x8
#define PPSM4     	0x10
#define PPSM5     	0x20
#define PPSM6     	0x40
#define PPSM7     	0x80

/* duplicate resolved by name mangling -- prepend PPSM */
#define PPSM_PPSM 	0xff

#define WOMM	(*(volatile unsigned char *)(REG_BASE + 0x00000256))

#define WOMM0     	0x1
#define WOMM1     	0x2
#define WOMM2     	0x4
#define WOMM3     	0x8
#define WOMM4     	0x10
#define WOMM5     	0x20
#define WOMM6     	0x40
#define WOMM7     	0x80

/* duplicate resolved by name mangling -- prepend WOMM */
#define WOMM_WOMM 	0xff

#define MODRR	(*(volatile unsigned char *)(REG_BASE + 0x00000257))

#define MODRR0    	0x1
#define MODRR1    	0x2
#define MODRR2    	0x4
#define MODRR3    	0x8
#define MODRR4    	0x10
#define MODRR5    	0x20
#define MODRR6    	0x40

/* duplicate resolved by name mangling -- prepend MODRR */
#define MODRR_MODRR	0x7f

#define PTP	(*(volatile unsigned char *)(REG_BASE + 0x00000258))

#define PTP0      	0x1
#define PTP1      	0x2
#define PTP2      	0x4
#define PTP3      	0x8
#define PTP4      	0x10
#define PTP5      	0x20
#define PTP6      	0x40
#define PTP7      	0x80

/* duplicate resolved by name mangling -- prepend PTP */
#define PTP_PTP   	0xff

#define PTIP	(*(volatile unsigned char *)(REG_BASE + 0x00000259))

#define PTIP0     	0x1
#define PTIP1     	0x2
#define PTIP2     	0x4
#define PTIP3     	0x8
#define PTIP4     	0x10
#define PTIP5     	0x20
#define PTIP6     	0x40
#define PTIP7     	0x80

/* duplicate resolved by name mangling -- prepend PTIP */
#define PTIP_PTIP 	0xff

#define DDRP	(*(volatile unsigned char *)(REG_BASE + 0x0000025A))

#define DDRP0     	0x1
#define DDRP1     	0x2
#define DDRP2     	0x4
#define DDRP3     	0x8
#define DDRP4     	0x10
#define DDRP5     	0x20
#define DDRP6     	0x40
#define DDRP7     	0x80

/* duplicate resolved by name mangling -- prepend DDRP */
#define DDRP_DDRP 	0xff

#define RDRP	(*(volatile unsigned char *)(REG_BASE + 0x0000025B))

#define RDRP0     	0x1
#define RDRP1     	0x2
#define RDRP2     	0x4
#define RDRP3     	0x8
#define RDRP4     	0x10
#define RDRP5     	0x20
#define RDRP6     	0x40
#define RDRP7     	0x80

/* duplicate resolved by name mangling -- prepend RDRP */
#define RDRP_RDRP 	0xff

#define PERP	(*(volatile unsigned char *)(REG_BASE + 0x0000025C))

#define PERP0     	0x1
#define PERP1     	0x2
#define PERP2     	0x4
#define PERP3     	0x8
#define PERP4     	0x10
#define PERP5     	0x20
#define PERP6     	0x40
#define PERP7     	0x80

/* duplicate resolved by name mangling -- prepend PERP */
#define PERP_PERP 	0xff

#define PPSP	(*(volatile unsigned char *)(REG_BASE + 0x0000025D))

#define PPSP0     	0x1
#define PPSP1     	0x2
#define PPSP2     	0x4
#define PPSP3     	0x8
#define PPSP4     	0x10
#define PPSP5     	0x20
#define PPSP6     	0x40
#define PPSP7     	0x80

/* duplicate resolved by name mangling -- prepend PPSP */
#define PPSP_PPSP 	0xff

#define PIEP	(*(volatile unsigned char *)(REG_BASE + 0x0000025E))

#define PIEP0     	0x1
#define PIEP1     	0x2
#define PIEP2     	0x4
#define PIEP3     	0x8
#define PIEP4     	0x10
#define PIEP5     	0x20
#define PIEP6     	0x40
#define PIEP7     	0x80

/* duplicate resolved by name mangling -- prepend PIEP */
#define PIEP_PIEP 	0xff

#define PIFP	(*(volatile unsigned char *)(REG_BASE + 0x0000025F))

#define PIFP0     	0x1
#define PIFP1     	0x2
#define PIFP2     	0x4
#define PIFP3     	0x8
#define PIFP4     	0x10
#define PIFP5     	0x20
#define PIFP6     	0x40
#define PIFP7     	0x80

/* duplicate resolved by name mangling -- prepend PIFP */
#define PIFP_PIFP 	0xff

#define PTH	(*(volatile unsigned char *)(REG_BASE + 0x00000260))

#define PTH0      	0x1
#define PTH1      	0x2
#define PTH2      	0x4
#define PTH3      	0x8
#define PTH4      	0x10
#define PTH5      	0x20
#define PTH6      	0x40
#define PTH7      	0x80

/* duplicate resolved by name mangling -- prepend PTH */
#define PTH_PTH   	0xff

#define PTIH	(*(volatile unsigned char *)(REG_BASE + 0x00000261))

#define PTIH0     	0x1
#define PTIH1     	0x2
#define PTIH2     	0x4
#define PTIH3     	0x8
#define PTIH4     	0x10
#define PTIH5     	0x20
#define PTIH6     	0x40
#define PTIH7     	0x80

/* duplicate resolved by name mangling -- prepend PTIH */
#define PTIH_PTIH 	0xff

#define DDRH	(*(volatile unsigned char *)(REG_BASE + 0x00000262))

#define DDRH0     	0x1
#define DDRH1     	0x2
#define DDRH2     	0x4
#define DDRH3     	0x8
#define DDRH4     	0x10
#define DDRH5     	0x20
#define DDRH6     	0x40
#define DDRH7     	0x80

/* duplicate resolved by name mangling -- prepend DDRH */
#define DDRH_DDRH 	0xff

