dldavis007/dg128_gcc_motion/Embedded/Include/mc9s12dg128_imagecraft_reference.h
#define RDRH	(*(volatile unsigned char *)(REG_BASE + 0x00000263))

#define RDRH0     	0x1
#define RDRH1     	0x2
#define RDRH2     	0x4
#define RDRH3     	0x8
#define RDRH4     	0x10
#define RDRH5     	0x20
#define RDRH6     	0x40
#define RDRH7     	0x80

/* duplicate resolved by name mangling -- prepend RDRH */
#define RDRH_RDRH 	0xff

#define PERH	(*(volatile unsigned char *)(REG_BASE + 0x00000264))

#define PERH0     	0x1
#define PERH1     	0x2
#define PERH2     	0x4
#define PERH3     	0x8
#define PERH4     	0x10
#define PERH5     	0x20
#define PERH6     	0x40
#define PERH7     	0x80

/* duplicate resolved by name mangling -- prepend PERH */
#define PERH_PERH 	0xff

#define PPSH	(*(volatile unsigned char *)(REG_BASE + 0x00000265))

#define PPSH0     	0x1
#define PPSH1     	0x2
#define PPSH2     	0x4
#define PPSH3     	0x8
#define PPSH4     	0x10
#define PPSH5     	0x20
#define PPSH6     	0x40
#define PPSH7     	0x80

/* duplicate resolved by name mangling -- prepend PPSH */
#define PPSH_PPSH 	0xff

#define PIEH	(*(volatile unsigned char *)(REG_BASE + 0x00000266))

#define PIEH0     	0x1
#define PIEH1     	0x2
#define PIEH2     	0x4
#define PIEH3     	0x8
#define PIEH4     	0x10
#define PIEH5     	0x20
#define PIEH6     	0x40
#define PIEH7     	0x80

/* duplicate resolved by name mangling -- prepend PIEH */
#define PIEH_PIEH 	0xff

#define PIFH	(*(volatile unsigned char *)(REG_BASE + 0x00000267))

#define PIFH0     	0x1
#define PIFH1     	0x2
#define PIFH2     	0x4
#define PIFH3     	0x8
#define PIFH4     	0x10
#define PIFH5     	0x20
#define PIFH6     	0x40
#define PIFH7     	0x80

/* duplicate resolved by name mangling -- prepend PIFH */
#define PIFH_PIFH 	0xff

#define PTJ	(*(volatile unsigned char *)(REG_BASE + 0x00000268))

#define PTJ0      	0x1
#define PTJ1      	0x2
#define PTJ6      	0x40
#define PTJ7      	0x80

/* duplicate resolved by name mangling -- prepend PTJ */
#define PTJ_PTJ   	0x3
#define PTJ_6     	0xc0

#define PTIJ	(*(volatile unsigned char *)(REG_BASE + 0x00000269))

#define PTIJ0     	0x1
#define PTIJ1     	0x2
#define PTIJ6     	0x40
#define PTIJ7     	0x80

/* duplicate resolved by name mangling -- prepend PTIJ */
#define PTIJ_PTIJ 	0x3
#define PTIJ_6    	0xc0

#define DDRJ	(*(volatile unsigned char *)(REG_BASE + 0x0000026A))

#define DDRJ0     	0x1
#define DDRJ1     	0x2
#define DDRJ6     	0x40
#define DDRJ7     	0x80

/* duplicate resolved by name mangling -- prepend DDRJ */
#define DDRJ_DDRJ 	0x3
#define DDRJ_6    	0xc0

#define RDRJ	(*(volatile unsigned char *)(REG_BASE + 0x0000026B))

#define RDRJ0     	0x1
#define RDRJ1     	0x2
#define RDRJ6     	0x40
#define RDRJ7     	0x80

/* duplicate resolved by name mangling -- prepend RDRJ */
#define RDRJ_RDRJ 	0x3
#define RDRJ_6    	0xc0

#define PERJ	(*(volatile unsigned char *)(REG_BASE + 0x0000026C))

#define PERJ0     	0x1
#define PERJ1     	0x2
#define PERJ6     	0x40
#define PERJ7     	0x80

/* duplicate resolved by name mangling -- prepend PERJ */
#define PERJ_PERJ 	0x3
#define PERJ_6    	0xc0

#define PPSJ	(*(volatile unsigned char *)(REG_BASE + 0x0000026D))

#define PPSJ0     	0x1
#define PPSJ1     	0x2
#define PPSJ6     	0x40
#define PPSJ7     	0x80

/* duplicate resolved by name mangling -- prepend PPSJ */
#define PPSJ_PPSJ 	0x3
#define PPSJ_6    	0xc0

#define PIEJ	(*(volatile unsigned char *)(REG_BASE + 0x0000026E))

#define PIEJ0     	0x1
#define PIEJ1     	0x2
#define PIEJ6     	0x40
#define PIEJ7     	0x80

/* duplicate resolved by name mangling -- prepend PIEJ */
#define PIEJ_PIEJ 	0x3
#define PIEJ_6    	0xc0

#define PIFJ	(*(volatile unsigned char *)(REG_BASE + 0x0000026F))

#define PIFJ0     	0x1
#define PIFJ1     	0x2
#define PIFJ6     	0x40
#define PIFJ7     	0x80

/* duplicate resolved by name mangling -- prepend PIFJ */
#define PIFJ_PIFJ 	0x3
#define PIFJ_6    	0xc0

#define CAN4CTL0	(*(volatile unsigned char *)(REG_BASE + 0x00000280))

/* duplicate resolved by name mangling -- prepend CAN4CTL0 */

#define CAN4CTL0_INITRQ	0x1

/* duplicate resolved by name mangling -- prepend CAN4CTL0 */
#define CAN4CTL0_SLPRQ	0x2

/* duplicate resolved by name mangling -- prepend CAN4CTL0 */
#define CAN4CTL0_WUPE	0x4

/* duplicate resolved by name mangling -- prepend CAN4CTL0 */
#define CAN4CTL0_TIME	0x8

/* duplicate resolved by name mangling -- prepend CAN4CTL0 */
#define CAN4CTL0_SYNCH	0x10

/* duplicate resolved by name mangling -- prepend CAN4CTL0 */
#define CAN4CTL0_CSWAI	0x20

/* duplicate resolved by name mangling -- prepend CAN4CTL0 */
#define CAN4CTL0_RXACT	0x40

/* duplicate resolved by name mangling -- prepend CAN4CTL0 */
#define CAN4CTL0_RXFRM	0x80

#define CAN4CTL1	(*(volatile unsigned char *)(REG_BASE + 0x00000281))

/* duplicate resolved by name mangling -- prepend CAN4CTL1 */

#define CAN4CTL1_INITAK	0x1

/* duplicate resolved by name mangling -- prepend CAN4CTL1 */
#define CAN4CTL1_SLPAK	0x2

/* duplicate resolved by name mangling -- prepend CAN4CTL1 */
#define CAN4CTL1_WUPM	0x4

/* duplicate resolved by name mangling -- prepend CAN4CTL1 */
#define CAN4CTL1_LISTEN	0x10

/* duplicate resolved by name mangling -- prepend CAN4CTL1 */
#define CAN4CTL1_LOOPB	0x20

/* duplicate resolved by name mangling -- prepend CAN4CTL1 */
#define CAN4CTL1_CLKSRC	0x40

/* duplicate resolved by name mangling -- prepend CAN4CTL1 */
#define CAN4CTL1_CANE	0x80

#define CAN4BTR0	(*(volatile unsigned char *)(REG_BASE + 0x00000282))

/* duplicate resolved by name mangling -- prepend CAN4BTR0 */

#define CAN4BTR0_BRP0	0x1

/* duplicate resolved by name mangling -- prepend CAN4BTR0 */
#define CAN4BTR0_BRP1	0x2

/* duplicate resolved by name mangling -- prepend CAN4BTR0 */
#define CAN4BTR0_BRP2	0x4

/* duplicate resolved by name mangling -- prepend CAN4BTR0 */
#define CAN4BTR0_BRP3	0x8

/* duplicate resolved by name mangling -- prepend CAN4BTR0 */
#define CAN4BTR0_BRP4	0x10

/* duplicate resolved by name mangling -- prepend CAN4BTR0 */
#define CAN4BTR0_BRP5	0x20

/* duplicate resolved by name mangling -- prepend CAN4BTR0 */
#define CAN4BTR0_SJW0	0x40

/* duplicate resolved by name mangling -- prepend CAN4BTR0 */
#define CAN4BTR0_SJW1	0x80

/* duplicate resolved by name mangling -- prepend CAN4BTR0 */
#define CAN4BTR0_BRP	0x3f

/* duplicate resolved by name mangling -- prepend CAN4BTR0 */
#define CAN4BTR0_SJW	0xc0

#define CAN4BTR1	(*(volatile unsigned char *)(REG_BASE + 0x00000283))

