dldavis007/dg128_gcc_motion/Embedded/Include/mc9s12dg128_imagecraft_reference.h
/* duplicate resolved by name mangling -- prepend CAN4BTR1 */

#define CAN4BTR1_TSEG10	0x1

/* duplicate resolved by name mangling -- prepend CAN4BTR1 */
#define CAN4BTR1_TSEG11	0x2

/* duplicate resolved by name mangling -- prepend CAN4BTR1 */
#define CAN4BTR1_TSEG12	0x4

/* duplicate resolved by name mangling -- prepend CAN4BTR1 */
#define CAN4BTR1_TSEG13	0x8

/* duplicate resolved by name mangling -- prepend CAN4BTR1 */
#define CAN4BTR1_TSEG20	0x10

/* duplicate resolved by name mangling -- prepend CAN4BTR1 */
#define CAN4BTR1_TSEG21	0x20

/* duplicate resolved by name mangling -- prepend CAN4BTR1 */
#define CAN4BTR1_TSEG22	0x40

/* duplicate resolved by name mangling -- prepend CAN4BTR1 */
#define CAN4BTR1_SAMP	0x80

/* duplicate resolved by name mangling -- prepend CAN4BTR1 */
#define CAN4BTR1_TSEG_10	0xf

/* duplicate resolved by name mangling -- prepend CAN4BTR1 */
#define CAN4BTR1_TSEG_20	0x70

#define CAN4RFLG	(*(volatile unsigned char *)(REG_BASE + 0x00000284))

/* duplicate resolved by name mangling -- prepend CAN4RFLG */

#define CAN4RFLG_RXF	0x1

/* duplicate resolved by name mangling -- prepend CAN4RFLG */
#define CAN4RFLG_OVRIF	0x2

/* duplicate resolved by name mangling -- prepend CAN4RFLG */
#define CAN4RFLG_TSTAT0	0x4

/* duplicate resolved by name mangling -- prepend CAN4RFLG */
#define CAN4RFLG_TSTAT1	0x8

/* duplicate resolved by name mangling -- prepend CAN4RFLG */
#define CAN4RFLG_RSTAT0	0x10

/* duplicate resolved by name mangling -- prepend CAN4RFLG */
#define CAN4RFLG_RSTAT1	0x20

/* duplicate resolved by name mangling -- prepend CAN4RFLG */
#define CAN4RFLG_CSCIF	0x40

/* duplicate resolved by name mangling -- prepend CAN4RFLG */
#define CAN4RFLG_WUPIF	0x80

/* duplicate resolved by name mangling -- prepend CAN4RFLG */
#define CAN4RFLG_TSTAT	0xc

/* duplicate resolved by name mangling -- prepend CAN4RFLG */
#define CAN4RFLG_RSTAT	0x30

#define CAN4RIER	(*(volatile unsigned char *)(REG_BASE + 0x00000285))

/* duplicate resolved by name mangling -- prepend CAN4RIER */

#define CAN4RIER_RXFIE	0x1

/* duplicate resolved by name mangling -- prepend CAN4RIER */
#define CAN4RIER_OVRIE	0x2

/* duplicate resolved by name mangling -- prepend CAN4RIER */
#define CAN4RIER_TSTATE0	0x4

/* duplicate resolved by name mangling -- prepend CAN4RIER */
#define CAN4RIER_TSTATE1	0x8

/* duplicate resolved by name mangling -- prepend CAN4RIER */
#define CAN4RIER_RSTATE0	0x10

/* duplicate resolved by name mangling -- prepend CAN4RIER */
#define CAN4RIER_RSTATE1	0x20

/* duplicate resolved by name mangling -- prepend CAN4RIER */
#define CAN4RIER_CSCIE	0x40

/* duplicate resolved by name mangling -- prepend CAN4RIER */
#define CAN4RIER_WUPIE	0x80

/* duplicate resolved by name mangling -- prepend CAN4RIER */
#define CAN4RIER_TSTATE	0xc

/* duplicate resolved by name mangling -- prepend CAN4RIER */
#define CAN4RIER_RSTATE	0x30

#define CAN4TFLG	(*(volatile unsigned char *)(REG_BASE + 0x00000286))

/* duplicate resolved by name mangling -- prepend CAN4TFLG */

#define CAN4TFLG_TXE0	0x1

/* duplicate resolved by name mangling -- prepend CAN4TFLG */
#define CAN4TFLG_TXE1	0x2

/* duplicate resolved by name mangling -- prepend CAN4TFLG */
#define CAN4TFLG_TXE2	0x4

/* duplicate resolved by name mangling -- prepend CAN4TFLG */
#define CAN4TFLG_TXE	0x7

#define CAN4TIER	(*(volatile unsigned char *)(REG_BASE + 0x00000287))

/* duplicate resolved by name mangling -- prepend CAN4TIER */

#define CAN4TIER_TXEIE0	0x1

/* duplicate resolved by name mangling -- prepend CAN4TIER */
#define CAN4TIER_TXEIE1	0x2

/* duplicate resolved by name mangling -- prepend CAN4TIER */
#define CAN4TIER_TXEIE2	0x4

/* duplicate resolved by name mangling -- prepend CAN4TIER */
#define CAN4TIER_TXEIE	0x7

#define CAN4TARQ	(*(volatile unsigned char *)(REG_BASE + 0x00000288))

/* duplicate resolved by name mangling -- prepend CAN4TARQ */

#define CAN4TARQ_ABTRQ0	0x1

/* duplicate resolved by name mangling -- prepend CAN4TARQ */
#define CAN4TARQ_ABTRQ1	0x2

/* duplicate resolved by name mangling -- prepend CAN4TARQ */
#define CAN4TARQ_ABTRQ2	0x4

/* duplicate resolved by name mangling -- prepend CAN4TARQ */
#define CAN4TARQ_ABTRQ	0x7

#define CAN4TAAK	(*(volatile unsigned char *)(REG_BASE + 0x00000289))

/* duplicate resolved by name mangling -- prepend CAN4TAAK */

#define CAN4TAAK_ABTAK0	0x1

/* duplicate resolved by name mangling -- prepend CAN4TAAK */
#define CAN4TAAK_ABTAK1	0x2

/* duplicate resolved by name mangling -- prepend CAN4TAAK */
#define CAN4TAAK_ABTAK2	0x4

/* duplicate resolved by name mangling -- prepend CAN4TAAK */
#define CAN4TAAK_ABTAK	0x7

#define CAN4TBSEL	(*(volatile unsigned char *)(REG_BASE + 0x0000028A))

/* duplicate resolved by name mangling -- prepend CAN4TBSEL */

#define CAN4TBSEL_TX0	0x1

/* duplicate resolved by name mangling -- prepend CAN4TBSEL */
#define CAN4TBSEL_TX1	0x2

/* duplicate resolved by name mangling -- prepend CAN4TBSEL */
#define CAN4TBSEL_TX2	0x4

/* duplicate resolved by name mangling -- prepend CAN4TBSEL */
#define CAN4TBSEL_TX	0x7

#define CAN4IDAC	(*(volatile unsigned char *)(REG_BASE + 0x0000028B))

/* duplicate resolved by name mangling -- prepend CAN4IDAC */

#define CAN4IDAC_IDHIT0	0x1

/* duplicate resolved by name mangling -- prepend CAN4IDAC */
#define CAN4IDAC_IDHIT1	0x2

/* duplicate resolved by name mangling -- prepend CAN4IDAC */
#define CAN4IDAC_IDHIT2	0x4

/* duplicate resolved by name mangling -- prepend CAN4IDAC */
#define CAN4IDAC_IDAM0	0x10

/* duplicate resolved by name mangling -- prepend CAN4IDAC */
#define CAN4IDAC_IDAM1	0x20

/* duplicate resolved by name mangling -- prepend CAN4IDAC */
#define CAN4IDAC_IDHIT	0x7

/* duplicate resolved by name mangling -- prepend CAN4IDAC */
#define CAN4IDAC_IDAM	0x30

#define CAN4RXERR	(*(volatile unsigned char *)(REG_BASE + 0x0000028E))

/* duplicate resolved by name mangling -- prepend CAN4RXERR */

#define CAN4RXERR_RXERR0	0x1

/* duplicate resolved by name mangling -- prepend CAN4RXERR */
#define CAN4RXERR_RXERR1	0x2

