dldavis007/dg128_gcc_motion/Embedded/Include/mc9s12dg128_imagecraft_reference.h
/* duplicate resolved by name mangling -- prepend CAN4RXERR */
#define CAN4RXERR_RXERR2	0x4

/* duplicate resolved by name mangling -- prepend CAN4RXERR */
#define CAN4RXERR_RXERR3	0x8

/* duplicate resolved by name mangling -- prepend CAN4RXERR */
#define CAN4RXERR_RXERR4	0x10

/* duplicate resolved by name mangling -- prepend CAN4RXERR */
#define CAN4RXERR_RXERR5	0x20

/* duplicate resolved by name mangling -- prepend CAN4RXERR */
#define CAN4RXERR_RXERR6	0x40

/* duplicate resolved by name mangling -- prepend CAN4RXERR */
#define CAN4RXERR_RXERR7	0x80

/* duplicate resolved by name mangling -- prepend CAN4RXERR */
#define CAN4RXERR_RXERR	0xff

#define CAN4TXERR	(*(volatile unsigned char *)(REG_BASE + 0x0000028F))

/* duplicate resolved by name mangling -- prepend CAN4TXERR */

#define CAN4TXERR_TXERR0	0x1

/* duplicate resolved by name mangling -- prepend CAN4TXERR */
#define CAN4TXERR_TXERR1	0x2

/* duplicate resolved by name mangling -- prepend CAN4TXERR */
#define CAN4TXERR_TXERR2	0x4

/* duplicate resolved by name mangling -- prepend CAN4TXERR */
#define CAN4TXERR_TXERR3	0x8

/* duplicate resolved by name mangling -- prepend CAN4TXERR */
#define CAN4TXERR_TXERR4	0x10

/* duplicate resolved by name mangling -- prepend CAN4TXERR */
#define CAN4TXERR_TXERR5	0x20

/* duplicate resolved by name mangling -- prepend CAN4TXERR */
#define CAN4TXERR_TXERR6	0x40

/* duplicate resolved by name mangling -- prepend CAN4TXERR */
#define CAN4TXERR_TXERR7	0x80

/* duplicate resolved by name mangling -- prepend CAN4TXERR */
#define CAN4TXERR_TXERR	0xff

#define CAN4IDAR0	(*(volatile unsigned char *)(REG_BASE + 0x00000290))

/* duplicate resolved by name mangling -- prepend CAN4IDAR0 */

#define CAN4IDAR0_AC0	0x1

/* duplicate resolved by name mangling -- prepend CAN4IDAR0 */
#define CAN4IDAR0_AC1	0x2

/* duplicate resolved by name mangling -- prepend CAN4IDAR0 */
#define CAN4IDAR0_AC2	0x4

/* duplicate resolved by name mangling -- prepend CAN4IDAR0 */
#define CAN4IDAR0_AC3	0x8

/* duplicate resolved by name mangling -- prepend CAN4IDAR0 */
#define CAN4IDAR0_AC4	0x10

/* duplicate resolved by name mangling -- prepend CAN4IDAR0 */
#define CAN4IDAR0_AC5	0x20

/* duplicate resolved by name mangling -- prepend CAN4IDAR0 */
#define CAN4IDAR0_AC6	0x40

/* duplicate resolved by name mangling -- prepend CAN4IDAR0 */
#define CAN4IDAR0_AC7	0x80

/* duplicate resolved by name mangling -- prepend CAN4IDAR0 */
#define CAN4IDAR0_AC	0xff

#define CAN4IDAR1	(*(volatile unsigned char *)(REG_BASE + 0x00000291))

/* duplicate resolved by name mangling -- prepend CAN4IDAR1 */

#define CAN4IDAR1_AC0	0x1

/* duplicate resolved by name mangling -- prepend CAN4IDAR1 */
#define CAN4IDAR1_AC1	0x2

/* duplicate resolved by name mangling -- prepend CAN4IDAR1 */
#define CAN4IDAR1_AC2	0x4

/* duplicate resolved by name mangling -- prepend CAN4IDAR1 */
#define CAN4IDAR1_AC3	0x8

/* duplicate resolved by name mangling -- prepend CAN4IDAR1 */
#define CAN4IDAR1_AC4	0x10

/* duplicate resolved by name mangling -- prepend CAN4IDAR1 */
#define CAN4IDAR1_AC5	0x20

/* duplicate resolved by name mangling -- prepend CAN4IDAR1 */
#define CAN4IDAR1_AC6	0x40

/* duplicate resolved by name mangling -- prepend CAN4IDAR1 */
#define CAN4IDAR1_AC7	0x80

/* duplicate resolved by name mangling -- prepend CAN4IDAR1 */
#define CAN4IDAR1_AC	0xff

#define CAN4IDAR2	(*(volatile unsigned char *)(REG_BASE + 0x00000292))

/* duplicate resolved by name mangling -- prepend CAN4IDAR2 */

#define CAN4IDAR2_AC0	0x1

/* duplicate resolved by name mangling -- prepend CAN4IDAR2 */
#define CAN4IDAR2_AC1	0x2

/* duplicate resolved by name mangling -- prepend CAN4IDAR2 */
#define CAN4IDAR2_AC2	0x4

/* duplicate resolved by name mangling -- prepend CAN4IDAR2 */
#define CAN4IDAR2_AC3	0x8

/* duplicate resolved by name mangling -- prepend CAN4IDAR2 */
#define CAN4IDAR2_AC4	0x10

/* duplicate resolved by name mangling -- prepend CAN4IDAR2 */
#define CAN4IDAR2_AC5	0x20

/* duplicate resolved by name mangling -- prepend CAN4IDAR2 */
#define CAN4IDAR2_AC6	0x40

/* duplicate resolved by name mangling -- prepend CAN4IDAR2 */
#define CAN4IDAR2_AC7	0x80

/* duplicate resolved by name mangling -- prepend CAN4IDAR2 */
#define CAN4IDAR2_AC	0xff

#define CAN4IDAR3	(*(volatile unsigned char *)(REG_BASE + 0x00000293))

/* duplicate resolved by name mangling -- prepend CAN4IDAR3 */

#define CAN4IDAR3_AC0	0x1

/* duplicate resolved by name mangling -- prepend CAN4IDAR3 */
#define CAN4IDAR3_AC1	0x2

/* duplicate resolved by name mangling -- prepend CAN4IDAR3 */
#define CAN4IDAR3_AC2	0x4

/* duplicate resolved by name mangling -- prepend CAN4IDAR3 */
#define CAN4IDAR3_AC3	0x8

/* duplicate resolved by name mangling -- prepend CAN4IDAR3 */
#define CAN4IDAR3_AC4	0x10

/* duplicate resolved by name mangling -- prepend CAN4IDAR3 */
#define CAN4IDAR3_AC5	0x20

/* duplicate resolved by name mangling -- prepend CAN4IDAR3 */
#define CAN4IDAR3_AC6	0x40

/* duplicate resolved by name mangling -- prepend CAN4IDAR3 */
#define CAN4IDAR3_AC7	0x80

/* duplicate resolved by name mangling -- prepend CAN4IDAR3 */
#define CAN4IDAR3_AC	0xff

#define CAN4IDMR0	(*(volatile unsigned char *)(REG_BASE + 0x00000294))

/* duplicate resolved by name mangling -- prepend CAN4IDMR0 */

#define CAN4IDMR0_AM0	0x1

/* duplicate resolved by name mangling -- prepend CAN4IDMR0 */
#define CAN4IDMR0_AM1	0x2

/* duplicate resolved by name mangling -- prepend CAN4IDMR0 */
#define CAN4IDMR0_AM2	0x4

/* duplicate resolved by name mangling -- prepend CAN4IDMR0 */
#define CAN4IDMR0_AM3	0x8

/* duplicate resolved by name mangling -- prepend CAN4IDMR0 */
#define CAN4IDMR0_AM4	0x10

/* duplicate resolved by name mangling -- prepend CAN4IDMR0 */
#define CAN4IDMR0_AM5	0x20

/* duplicate resolved by name mangling -- prepend CAN4IDMR0 */
#define CAN4IDMR0_AM6	0x40

/* duplicate resolved by name mangling -- prepend CAN4IDMR0 */
#define CAN4IDMR0_AM7	0x80

/* duplicate resolved by name mangling -- prepend CAN4IDMR0 */
#define CAN4IDMR0_AM	0xff

#define CAN4IDMR1	(*(volatile unsigned char *)(REG_BASE + 0x00000295))

/* duplicate resolved by name mangling -- prepend CAN4IDMR1 */

#define CAN4IDMR1_AM0	0x1

/* duplicate resolved by name mangling -- prepend CAN4IDMR1 */
#define CAN4IDMR1_AM1	0x2

/* duplicate resolved by name mangling -- prepend CAN4IDMR1 */
#define CAN4IDMR1_AM2	0x4

/* duplicate resolved by name mangling -- prepend CAN4IDMR1 */
#define CAN4IDMR1_AM3	0x8

/* duplicate resolved by name mangling -- prepend CAN4IDMR1 */
#define CAN4IDMR1_AM4	0x10

/* duplicate resolved by name mangling -- prepend CAN4IDMR1 */
#define CAN4IDMR1_AM5	0x20

/* duplicate resolved by name mangling -- prepend CAN4IDMR1 */
#define CAN4IDMR1_AM6	0x40

/* duplicate resolved by name mangling -- prepend CAN4IDMR1 */
#define CAN4IDMR1_AM7	0x80

/* duplicate resolved by name mangling -- prepend CAN4IDMR1 */
#define CAN4IDMR1_AM	0xff

