dldavis007/dg128_gcc_motion/Embedded/Include/mc9s12dg128_imagecraft_reference.h
#define CAN4IDMR2	(*(volatile unsigned char *)(REG_BASE + 0x00000296))

/* duplicate resolved by name mangling -- prepend CAN4IDMR2 */

#define CAN4IDMR2_AM0	0x1

/* duplicate resolved by name mangling -- prepend CAN4IDMR2 */
#define CAN4IDMR2_AM1	0x2

/* duplicate resolved by name mangling -- prepend CAN4IDMR2 */
#define CAN4IDMR2_AM2	0x4

/* duplicate resolved by name mangling -- prepend CAN4IDMR2 */
#define CAN4IDMR2_AM3	0x8

/* duplicate resolved by name mangling -- prepend CAN4IDMR2 */
#define CAN4IDMR2_AM4	0x10

/* duplicate resolved by name mangling -- prepend CAN4IDMR2 */
#define CAN4IDMR2_AM5	0x20

/* duplicate resolved by name mangling -- prepend CAN4IDMR2 */
#define CAN4IDMR2_AM6	0x40

/* duplicate resolved by name mangling -- prepend CAN4IDMR2 */
#define CAN4IDMR2_AM7	0x80

/* duplicate resolved by name mangling -- prepend CAN4IDMR2 */
#define CAN4IDMR2_AM	0xff

#define CAN4IDMR3	(*(volatile unsigned char *)(REG_BASE + 0x00000297))

/* duplicate resolved by name mangling -- prepend CAN4IDMR3 */

#define CAN4IDMR3_AM0	0x1

/* duplicate resolved by name mangling -- prepend CAN4IDMR3 */
#define CAN4IDMR3_AM1	0x2

/* duplicate resolved by name mangling -- prepend CAN4IDMR3 */
#define CAN4IDMR3_AM2	0x4

/* duplicate resolved by name mangling -- prepend CAN4IDMR3 */
#define CAN4IDMR3_AM3	0x8

/* duplicate resolved by name mangling -- prepend CAN4IDMR3 */
#define CAN4IDMR3_AM4	0x10

/* duplicate resolved by name mangling -- prepend CAN4IDMR3 */
#define CAN4IDMR3_AM5	0x20

/* duplicate resolved by name mangling -- prepend CAN4IDMR3 */
#define CAN4IDMR3_AM6	0x40

/* duplicate resolved by name mangling -- prepend CAN4IDMR3 */
#define CAN4IDMR3_AM7	0x80

/* duplicate resolved by name mangling -- prepend CAN4IDMR3 */
#define CAN4IDMR3_AM	0xff

#define CAN4IDAR4	(*(volatile unsigned char *)(REG_BASE + 0x00000298))

/* duplicate resolved by name mangling -- prepend CAN4IDAR4 */

#define CAN4IDAR4_AC0	0x1

/* duplicate resolved by name mangling -- prepend CAN4IDAR4 */
#define CAN4IDAR4_AC1	0x2

/* duplicate resolved by name mangling -- prepend CAN4IDAR4 */
#define CAN4IDAR4_AC2	0x4

/* duplicate resolved by name mangling -- prepend CAN4IDAR4 */
#define CAN4IDAR4_AC3	0x8

/* duplicate resolved by name mangling -- prepend CAN4IDAR4 */
#define CAN4IDAR4_AC4	0x10

/* duplicate resolved by name mangling -- prepend CAN4IDAR4 */
#define CAN4IDAR4_AC5	0x20

/* duplicate resolved by name mangling -- prepend CAN4IDAR4 */
#define CAN4IDAR4_AC6	0x40

/* duplicate resolved by name mangling -- prepend CAN4IDAR4 */
#define CAN4IDAR4_AC7	0x80

/* duplicate resolved by name mangling -- prepend CAN4IDAR4 */
#define CAN4IDAR4_AC	0xff

#define CAN4IDAR5	(*(volatile unsigned char *)(REG_BASE + 0x00000299))

/* duplicate resolved by name mangling -- prepend CAN4IDAR5 */

#define CAN4IDAR5_AC0	0x1

/* duplicate resolved by name mangling -- prepend CAN4IDAR5 */
#define CAN4IDAR5_AC1	0x2

/* duplicate resolved by name mangling -- prepend CAN4IDAR5 */
#define CAN4IDAR5_AC2	0x4

/* duplicate resolved by name mangling -- prepend CAN4IDAR5 */
#define CAN4IDAR5_AC3	0x8

/* duplicate resolved by name mangling -- prepend CAN4IDAR5 */
#define CAN4IDAR5_AC4	0x10

/* duplicate resolved by name mangling -- prepend CAN4IDAR5 */
#define CAN4IDAR5_AC5	0x20

/* duplicate resolved by name mangling -- prepend CAN4IDAR5 */
#define CAN4IDAR5_AC6	0x40

/* duplicate resolved by name mangling -- prepend CAN4IDAR5 */
#define CAN4IDAR5_AC7	0x80

/* duplicate resolved by name mangling -- prepend CAN4IDAR5 */
#define CAN4IDAR5_AC	0xff

#define CAN4IDAR6	(*(volatile unsigned char *)(REG_BASE + 0x0000029A))

/* duplicate resolved by name mangling -- prepend CAN4IDAR6 */

#define CAN4IDAR6_AC0	0x1

/* duplicate resolved by name mangling -- prepend CAN4IDAR6 */
#define CAN4IDAR6_AC1	0x2

/* duplicate resolved by name mangling -- prepend CAN4IDAR6 */
#define CAN4IDAR6_AC2	0x4

/* duplicate resolved by name mangling -- prepend CAN4IDAR6 */
#define CAN4IDAR6_AC3	0x8

/* duplicate resolved by name mangling -- prepend CAN4IDAR6 */
#define CAN4IDAR6_AC4	0x10

/* duplicate resolved by name mangling -- prepend CAN4IDAR6 */
#define CAN4IDAR6_AC5	0x20

/* duplicate resolved by name mangling -- prepend CAN4IDAR6 */
#define CAN4IDAR6_AC6	0x40

/* duplicate resolved by name mangling -- prepend CAN4IDAR6 */
#define CAN4IDAR6_AC7	0x80

/* duplicate resolved by name mangling -- prepend CAN4IDAR6 */
#define CAN4IDAR6_AC	0xff

#define CAN4IDAR7	(*(volatile unsigned char *)(REG_BASE + 0x0000029B))

/* duplicate resolved by name mangling -- prepend CAN4IDAR7 */

#define CAN4IDAR7_AC0	0x1

/* duplicate resolved by name mangling -- prepend CAN4IDAR7 */
#define CAN4IDAR7_AC1	0x2

/* duplicate resolved by name mangling -- prepend CAN4IDAR7 */
#define CAN4IDAR7_AC2	0x4

/* duplicate resolved by name mangling -- prepend CAN4IDAR7 */
#define CAN4IDAR7_AC3	0x8

/* duplicate resolved by name mangling -- prepend CAN4IDAR7 */
#define CAN4IDAR7_AC4	0x10

/* duplicate resolved by name mangling -- prepend CAN4IDAR7 */
#define CAN4IDAR7_AC5	0x20

/* duplicate resolved by name mangling -- prepend CAN4IDAR7 */
#define CAN4IDAR7_AC6	0x40

/* duplicate resolved by name mangling -- prepend CAN4IDAR7 */
#define CAN4IDAR7_AC7	0x80

/* duplicate resolved by name mangling -- prepend CAN4IDAR7 */
#define CAN4IDAR7_AC	0xff

#define CAN4IDMR4	(*(volatile unsigned char *)(REG_BASE + 0x0000029C))

/* duplicate resolved by name mangling -- prepend CAN4IDMR4 */

#define CAN4IDMR4_AM0	0x1

/* duplicate resolved by name mangling -- prepend CAN4IDMR4 */
#define CAN4IDMR4_AM1	0x2

/* duplicate resolved by name mangling -- prepend CAN4IDMR4 */
#define CAN4IDMR4_AM2	0x4

/* duplicate resolved by name mangling -- prepend CAN4IDMR4 */
#define CAN4IDMR4_AM3	0x8

/* duplicate resolved by name mangling -- prepend CAN4IDMR4 */
#define CAN4IDMR4_AM4	0x10

/* duplicate resolved by name mangling -- prepend CAN4IDMR4 */
#define CAN4IDMR4_AM5	0x20

/* duplicate resolved by name mangling -- prepend CAN4IDMR4 */
#define CAN4IDMR4_AM6	0x40

/* duplicate resolved by name mangling -- prepend CAN4IDMR4 */
#define CAN4IDMR4_AM7	0x80

/* duplicate resolved by name mangling -- prepend CAN4IDMR4 */
#define CAN4IDMR4_AM	0xff

