dldavis007/dg128_gcc_motion/Embedded/Include/mc9s12dg128_imagecraft_reference.h
#define CAN4IDMR5	(*(volatile unsigned char *)(REG_BASE + 0x0000029D))

/* duplicate resolved by name mangling -- prepend CAN4IDMR5 */

#define CAN4IDMR5_AM0	0x1

/* duplicate resolved by name mangling -- prepend CAN4IDMR5 */
#define CAN4IDMR5_AM1	0x2

/* duplicate resolved by name mangling -- prepend CAN4IDMR5 */
#define CAN4IDMR5_AM2	0x4

/* duplicate resolved by name mangling -- prepend CAN4IDMR5 */
#define CAN4IDMR5_AM3	0x8

/* duplicate resolved by name mangling -- prepend CAN4IDMR5 */
#define CAN4IDMR5_AM4	0x10

/* duplicate resolved by name mangling -- prepend CAN4IDMR5 */
#define CAN4IDMR5_AM5	0x20

/* duplicate resolved by name mangling -- prepend CAN4IDMR5 */
#define CAN4IDMR5_AM6	0x40

/* duplicate resolved by name mangling -- prepend CAN4IDMR5 */
#define CAN4IDMR5_AM7	0x80

/* duplicate resolved by name mangling -- prepend CAN4IDMR5 */
#define CAN4IDMR5_AM	0xff

#define CAN4IDMR6	(*(volatile unsigned char *)(REG_BASE + 0x0000029E))

/* duplicate resolved by name mangling -- prepend CAN4IDMR6 */

#define CAN4IDMR6_AM0	0x1

/* duplicate resolved by name mangling -- prepend CAN4IDMR6 */
#define CAN4IDMR6_AM1	0x2

/* duplicate resolved by name mangling -- prepend CAN4IDMR6 */
#define CAN4IDMR6_AM2	0x4

/* duplicate resolved by name mangling -- prepend CAN4IDMR6 */
#define CAN4IDMR6_AM3	0x8

/* duplicate resolved by name mangling -- prepend CAN4IDMR6 */
#define CAN4IDMR6_AM4	0x10

/* duplicate resolved by name mangling -- prepend CAN4IDMR6 */
#define CAN4IDMR6_AM5	0x20

/* duplicate resolved by name mangling -- prepend CAN4IDMR6 */
#define CAN4IDMR6_AM6	0x40

/* duplicate resolved by name mangling -- prepend CAN4IDMR6 */
#define CAN4IDMR6_AM7	0x80

/* duplicate resolved by name mangling -- prepend CAN4IDMR6 */
#define CAN4IDMR6_AM	0xff

#define CAN4IDMR7	(*(volatile unsigned char *)(REG_BASE + 0x0000029F))

/* duplicate resolved by name mangling -- prepend CAN4IDMR7 */

#define CAN4IDMR7_AM0	0x1

/* duplicate resolved by name mangling -- prepend CAN4IDMR7 */
#define CAN4IDMR7_AM1	0x2

/* duplicate resolved by name mangling -- prepend CAN4IDMR7 */
#define CAN4IDMR7_AM2	0x4

/* duplicate resolved by name mangling -- prepend CAN4IDMR7 */
#define CAN4IDMR7_AM3	0x8

/* duplicate resolved by name mangling -- prepend CAN4IDMR7 */
#define CAN4IDMR7_AM4	0x10

/* duplicate resolved by name mangling -- prepend CAN4IDMR7 */
#define CAN4IDMR7_AM5	0x20

/* duplicate resolved by name mangling -- prepend CAN4IDMR7 */
#define CAN4IDMR7_AM6	0x40

/* duplicate resolved by name mangling -- prepend CAN4IDMR7 */
#define CAN4IDMR7_AM7	0x80

/* duplicate resolved by name mangling -- prepend CAN4IDMR7 */
#define CAN4IDMR7_AM	0xff

#define CAN4RXIDR0	(*(volatile unsigned char *)(REG_BASE + 0x000002A0))

/* duplicate resolved by name mangling -- prepend CAN4RXIDR0 */

#define CAN4RXIDR0_ID21	0x1

/* duplicate resolved by name mangling -- prepend CAN4RXIDR0 */
#define CAN4RXIDR0_ID22	0x2

/* duplicate resolved by name mangling -- prepend CAN4RXIDR0 */
#define CAN4RXIDR0_ID23	0x4

/* duplicate resolved by name mangling -- prepend CAN4RXIDR0 */
#define CAN4RXIDR0_ID24	0x8

/* duplicate resolved by name mangling -- prepend CAN4RXIDR0 */
#define CAN4RXIDR0_ID25	0x10

/* duplicate resolved by name mangling -- prepend CAN4RXIDR0 */
#define CAN4RXIDR0_ID26	0x20

/* duplicate resolved by name mangling -- prepend CAN4RXIDR0 */
#define CAN4RXIDR0_ID27	0x40

/* duplicate resolved by name mangling -- prepend CAN4RXIDR0 */
#define CAN4RXIDR0_ID28	0x80

/* duplicate resolved by name mangling -- prepend CAN4RXIDR0 */
#define CAN4RXIDR0_ID_21	0xff

#define CAN4RXIDR1	(*(volatile unsigned char *)(REG_BASE + 0x000002A1))

/* duplicate resolved by name mangling -- prepend CAN4RXIDR1 */

#define CAN4RXIDR1_ID15	0x1

/* duplicate resolved by name mangling -- prepend CAN4RXIDR1 */
#define CAN4RXIDR1_ID16	0x2

/* duplicate resolved by name mangling -- prepend CAN4RXIDR1 */
#define CAN4RXIDR1_ID17	0x4

/* duplicate resolved by name mangling -- prepend CAN4RXIDR1 */
#define CAN4RXIDR1_IDE	0x8

/* duplicate resolved by name mangling -- prepend CAN4RXIDR1 */
#define CAN4RXIDR1_SRR	0x10

/* duplicate resolved by name mangling -- prepend CAN4RXIDR1 */
#define CAN4RXIDR1_ID18	0x20

/* duplicate resolved by name mangling -- prepend CAN4RXIDR1 */
#define CAN4RXIDR1_ID19	0x40

/* duplicate resolved by name mangling -- prepend CAN4RXIDR1 */
#define CAN4RXIDR1_ID20	0x80

/* duplicate resolved by name mangling -- prepend CAN4RXIDR1 */
#define CAN4RXIDR1_ID_15	0x7

/* duplicate resolved by name mangling -- prepend CAN4RXIDR1 */
#define CAN4RXIDR1_ID_18	0xe0

#define CAN4RXIDR2	(*(volatile unsigned char *)(REG_BASE + 0x000002A2))

/* duplicate resolved by name mangling -- prepend CAN4RXIDR2 */

#define CAN4RXIDR2_ID7	0x1

/* duplicate resolved by name mangling -- prepend CAN4RXIDR2 */
#define CAN4RXIDR2_ID8	0x2

/* duplicate resolved by name mangling -- prepend CAN4RXIDR2 */
#define CAN4RXIDR2_ID9	0x4

/* duplicate resolved by name mangling -- prepend CAN4RXIDR2 */
#define CAN4RXIDR2_ID10	0x8

/* duplicate resolved by name mangling -- prepend CAN4RXIDR2 */
#define CAN4RXIDR2_ID11	0x10

/* duplicate resolved by name mangling -- prepend CAN4RXIDR2 */
#define CAN4RXIDR2_ID12	0x20

/* duplicate resolved by name mangling -- prepend CAN4RXIDR2 */
#define CAN4RXIDR2_ID13	0x40

/* duplicate resolved by name mangling -- prepend CAN4RXIDR2 */
#define CAN4RXIDR2_ID14	0x80

/* duplicate resolved by name mangling -- prepend CAN4RXIDR2 */
#define CAN4RXIDR2_ID_7	0xff

#define CAN4RXIDR3	(*(volatile unsigned char *)(REG_BASE + 0x000002A3))

/* duplicate resolved by name mangling -- prepend CAN4RXIDR3 */

#define CAN4RXIDR3_RTR	0x1

/* duplicate resolved by name mangling -- prepend CAN4RXIDR3 */
#define CAN4RXIDR3_ID0	0x2

/* duplicate resolved by name mangling -- prepend CAN4RXIDR3 */
#define CAN4RXIDR3_ID1	0x4

/* duplicate resolved by name mangling -- prepend CAN4RXIDR3 */
#define CAN4RXIDR3_ID2	0x8

/* duplicate resolved by name mangling -- prepend CAN4RXIDR3 */
#define CAN4RXIDR3_ID3	0x10

/* duplicate resolved by name mangling -- prepend CAN4RXIDR3 */
#define CAN4RXIDR3_ID4	0x20

/* duplicate resolved by name mangling -- prepend CAN4RXIDR3 */
#define CAN4RXIDR3_ID5	0x40

/* duplicate resolved by name mangling -- prepend CAN4RXIDR3 */
#define CAN4RXIDR3_ID6	0x80

/* duplicate resolved by name mangling -- prepend CAN4RXIDR3 */
#define CAN4RXIDR3_ID	0xfe

#define CAN4RXDSR0	(*(volatile unsigned char *)(REG_BASE + 0x000002A4))

/* duplicate resolved by name mangling -- prepend CAN4RXDSR0 */

#define CAN4RXDSR0_DB0	0x1

/* duplicate resolved by name mangling -- prepend CAN4RXDSR0 */
#define CAN4RXDSR0_DB1	0x2

/* duplicate resolved by name mangling -- prepend CAN4RXDSR0 */
#define CAN4RXDSR0_DB2	0x4

/* duplicate resolved by name mangling -- prepend CAN4RXDSR0 */
#define CAN4RXDSR0_DB3	0x8

/* duplicate resolved by name mangling -- prepend CAN4RXDSR0 */
#define CAN4RXDSR0_DB4	0x10

/* duplicate resolved by name mangling -- prepend CAN4RXDSR0 */
#define CAN4RXDSR0_DB5	0x20

/* duplicate resolved by name mangling -- prepend CAN4RXDSR0 */
#define CAN4RXDSR0_DB6	0x40

/* duplicate resolved by name mangling -- prepend CAN4RXDSR0 */
#define CAN4RXDSR0_DB7	0x80

/* duplicate resolved by name mangling -- prepend CAN4RXDSR0 */
#define CAN4RXDSR0_DB	0xff

