dldavis007/dg128_gcc_motion/Embedded/Include/mc9s12dg128_imagecraft_reference.h
#define CAN4RXDSR1	(*(volatile unsigned char *)(REG_BASE + 0x000002A5))

/* duplicate resolved by name mangling -- prepend CAN4RXDSR1 */

#define CAN4RXDSR1_DB0	0x1

/* duplicate resolved by name mangling -- prepend CAN4RXDSR1 */
#define CAN4RXDSR1_DB1	0x2

/* duplicate resolved by name mangling -- prepend CAN4RXDSR1 */
#define CAN4RXDSR1_DB2	0x4

/* duplicate resolved by name mangling -- prepend CAN4RXDSR1 */
#define CAN4RXDSR1_DB3	0x8

/* duplicate resolved by name mangling -- prepend CAN4RXDSR1 */
#define CAN4RXDSR1_DB4	0x10

/* duplicate resolved by name mangling -- prepend CAN4RXDSR1 */
#define CAN4RXDSR1_DB5	0x20

/* duplicate resolved by name mangling -- prepend CAN4RXDSR1 */
#define CAN4RXDSR1_DB6	0x40

/* duplicate resolved by name mangling -- prepend CAN4RXDSR1 */
#define CAN4RXDSR1_DB7	0x80

/* duplicate resolved by name mangling -- prepend CAN4RXDSR1 */
#define CAN4RXDSR1_DB	0xff

#define CAN4RXDSR2	(*(volatile unsigned char *)(REG_BASE + 0x000002A6))

/* duplicate resolved by name mangling -- prepend CAN4RXDSR2 */

#define CAN4RXDSR2_DB0	0x1

/* duplicate resolved by name mangling -- prepend CAN4RXDSR2 */
#define CAN4RXDSR2_DB1	0x2

/* duplicate resolved by name mangling -- prepend CAN4RXDSR2 */
#define CAN4RXDSR2_DB2	0x4

/* duplicate resolved by name mangling -- prepend CAN4RXDSR2 */
#define CAN4RXDSR2_DB3	0x8

/* duplicate resolved by name mangling -- prepend CAN4RXDSR2 */
#define CAN4RXDSR2_DB4	0x10

/* duplicate resolved by name mangling -- prepend CAN4RXDSR2 */
#define CAN4RXDSR2_DB5	0x20

/* duplicate resolved by name mangling -- prepend CAN4RXDSR2 */
#define CAN4RXDSR2_DB6	0x40

/* duplicate resolved by name mangling -- prepend CAN4RXDSR2 */
#define CAN4RXDSR2_DB7	0x80

/* duplicate resolved by name mangling -- prepend CAN4RXDSR2 */
#define CAN4RXDSR2_DB	0xff

#define CAN4RXDSR3	(*(volatile unsigned char *)(REG_BASE + 0x000002A7))

/* duplicate resolved by name mangling -- prepend CAN4RXDSR3 */

#define CAN4RXDSR3_DB0	0x1

/* duplicate resolved by name mangling -- prepend CAN4RXDSR3 */
#define CAN4RXDSR3_DB1	0x2

/* duplicate resolved by name mangling -- prepend CAN4RXDSR3 */
#define CAN4RXDSR3_DB2	0x4

/* duplicate resolved by name mangling -- prepend CAN4RXDSR3 */
#define CAN4RXDSR3_DB3	0x8

/* duplicate resolved by name mangling -- prepend CAN4RXDSR3 */
#define CAN4RXDSR3_DB4	0x10

/* duplicate resolved by name mangling -- prepend CAN4RXDSR3 */
#define CAN4RXDSR3_DB5	0x20

/* duplicate resolved by name mangling -- prepend CAN4RXDSR3 */
#define CAN4RXDSR3_DB6	0x40

/* duplicate resolved by name mangling -- prepend CAN4RXDSR3 */
#define CAN4RXDSR3_DB7	0x80

/* duplicate resolved by name mangling -- prepend CAN4RXDSR3 */
#define CAN4RXDSR3_DB	0xff

#define CAN4RXDSR4	(*(volatile unsigned char *)(REG_BASE + 0x000002A8))

/* duplicate resolved by name mangling -- prepend CAN4RXDSR4 */

#define CAN4RXDSR4_DB0	0x1

/* duplicate resolved by name mangling -- prepend CAN4RXDSR4 */
#define CAN4RXDSR4_DB1	0x2

/* duplicate resolved by name mangling -- prepend CAN4RXDSR4 */
#define CAN4RXDSR4_DB2	0x4

/* duplicate resolved by name mangling -- prepend CAN4RXDSR4 */
#define CAN4RXDSR4_DB3	0x8

/* duplicate resolved by name mangling -- prepend CAN4RXDSR4 */
#define CAN4RXDSR4_DB4	0x10

/* duplicate resolved by name mangling -- prepend CAN4RXDSR4 */
#define CAN4RXDSR4_DB5	0x20

/* duplicate resolved by name mangling -- prepend CAN4RXDSR4 */
#define CAN4RXDSR4_DB6	0x40

/* duplicate resolved by name mangling -- prepend CAN4RXDSR4 */
#define CAN4RXDSR4_DB7	0x80

/* duplicate resolved by name mangling -- prepend CAN4RXDSR4 */
#define CAN4RXDSR4_DB	0xff

#define CAN4RXDSR5	(*(volatile unsigned char *)(REG_BASE + 0x000002A9))

/* duplicate resolved by name mangling -- prepend CAN4RXDSR5 */

#define CAN4RXDSR5_DB0	0x1

/* duplicate resolved by name mangling -- prepend CAN4RXDSR5 */
#define CAN4RXDSR5_DB1	0x2

/* duplicate resolved by name mangling -- prepend CAN4RXDSR5 */
#define CAN4RXDSR5_DB2	0x4

/* duplicate resolved by name mangling -- prepend CAN4RXDSR5 */
#define CAN4RXDSR5_DB3	0x8

/* duplicate resolved by name mangling -- prepend CAN4RXDSR5 */
#define CAN4RXDSR5_DB4	0x10

/* duplicate resolved by name mangling -- prepend CAN4RXDSR5 */
#define CAN4RXDSR5_DB5	0x20

/* duplicate resolved by name mangling -- prepend CAN4RXDSR5 */
#define CAN4RXDSR5_DB6	0x40

/* duplicate resolved by name mangling -- prepend CAN4RXDSR5 */
#define CAN4RXDSR5_DB7	0x80

/* duplicate resolved by name mangling -- prepend CAN4RXDSR5 */
#define CAN4RXDSR5_DB	0xff

#define CAN4RXDSR6	(*(volatile unsigned char *)(REG_BASE + 0x000002AA))

/* duplicate resolved by name mangling -- prepend CAN4RXDSR6 */

#define CAN4RXDSR6_DB0	0x1

/* duplicate resolved by name mangling -- prepend CAN4RXDSR6 */
#define CAN4RXDSR6_DB1	0x2

/* duplicate resolved by name mangling -- prepend CAN4RXDSR6 */
#define CAN4RXDSR6_DB2	0x4

/* duplicate resolved by name mangling -- prepend CAN4RXDSR6 */
#define CAN4RXDSR6_DB3	0x8

/* duplicate resolved by name mangling -- prepend CAN4RXDSR6 */
#define CAN4RXDSR6_DB4	0x10

/* duplicate resolved by name mangling -- prepend CAN4RXDSR6 */
#define CAN4RXDSR6_DB5	0x20

/* duplicate resolved by name mangling -- prepend CAN4RXDSR6 */
#define CAN4RXDSR6_DB6	0x40

/* duplicate resolved by name mangling -- prepend CAN4RXDSR6 */
#define CAN4RXDSR6_DB7	0x80

/* duplicate resolved by name mangling -- prepend CAN4RXDSR6 */
#define CAN4RXDSR6_DB	0xff

#define CAN4RXDSR7	(*(volatile unsigned char *)(REG_BASE + 0x000002AB))

/* duplicate resolved by name mangling -- prepend CAN4RXDSR7 */

#define CAN4RXDSR7_DB0	0x1

/* duplicate resolved by name mangling -- prepend CAN4RXDSR7 */
#define CAN4RXDSR7_DB1	0x2

/* duplicate resolved by name mangling -- prepend CAN4RXDSR7 */
#define CAN4RXDSR7_DB2	0x4

/* duplicate resolved by name mangling -- prepend CAN4RXDSR7 */
#define CAN4RXDSR7_DB3	0x8

/* duplicate resolved by name mangling -- prepend CAN4RXDSR7 */
#define CAN4RXDSR7_DB4	0x10

/* duplicate resolved by name mangling -- prepend CAN4RXDSR7 */
#define CAN4RXDSR7_DB5	0x20

/* duplicate resolved by name mangling -- prepend CAN4RXDSR7 */
#define CAN4RXDSR7_DB6	0x40

/* duplicate resolved by name mangling -- prepend CAN4RXDSR7 */
#define CAN4RXDSR7_DB7	0x80

/* duplicate resolved by name mangling -- prepend CAN4RXDSR7 */
#define CAN4RXDSR7_DB	0xff

