dldavis007/dg128_gcc_motion/Embedded/Include/mc9s12dg128_imagecraft_reference.h
#define CAN4RXDLR	(*(volatile unsigned char *)(REG_BASE + 0x000002AC))

/* duplicate resolved by name mangling -- prepend CAN4RXDLR */

#define CAN4RXDLR_DLC0	0x1

/* duplicate resolved by name mangling -- prepend CAN4RXDLR */
#define CAN4RXDLR_DLC1	0x2

/* duplicate resolved by name mangling -- prepend CAN4RXDLR */
#define CAN4RXDLR_DLC2	0x4

/* duplicate resolved by name mangling -- prepend CAN4RXDLR */
#define CAN4RXDLR_DLC3	0x8

/* duplicate resolved by name mangling -- prepend CAN4RXDLR */
#define CAN4RXDLR_DLC	0xf

#define CAN4TXIDR0	(*(volatile unsigned char *)(REG_BASE + 0x000002B0))

/* duplicate resolved by name mangling -- prepend CAN4TXIDR0 */

#define CAN4TXIDR0_ID21	0x1

/* duplicate resolved by name mangling -- prepend CAN4TXIDR0 */
#define CAN4TXIDR0_ID22	0x2

/* duplicate resolved by name mangling -- prepend CAN4TXIDR0 */
#define CAN4TXIDR0_ID23	0x4

/* duplicate resolved by name mangling -- prepend CAN4TXIDR0 */
#define CAN4TXIDR0_ID24	0x8

/* duplicate resolved by name mangling -- prepend CAN4TXIDR0 */
#define CAN4TXIDR0_ID25	0x10

/* duplicate resolved by name mangling -- prepend CAN4TXIDR0 */
#define CAN4TXIDR0_ID26	0x20

/* duplicate resolved by name mangling -- prepend CAN4TXIDR0 */
#define CAN4TXIDR0_ID27	0x40

/* duplicate resolved by name mangling -- prepend CAN4TXIDR0 */
#define CAN4TXIDR0_ID28	0x80

/* duplicate resolved by name mangling -- prepend CAN4TXIDR0 */
#define CAN4TXIDR0_ID_21	0xff

#define CAN4TXIDR1	(*(volatile unsigned char *)(REG_BASE + 0x000002B1))

/* duplicate resolved by name mangling -- prepend CAN4TXIDR1 */

#define CAN4TXIDR1_ID15	0x1

/* duplicate resolved by name mangling -- prepend CAN4TXIDR1 */
#define CAN4TXIDR1_ID16	0x2

/* duplicate resolved by name mangling -- prepend CAN4TXIDR1 */
#define CAN4TXIDR1_ID17	0x4

/* duplicate resolved by name mangling -- prepend CAN4TXIDR1 */
#define CAN4TXIDR1_IDE	0x8

/* duplicate resolved by name mangling -- prepend CAN4TXIDR1 */
#define CAN4TXIDR1_SRR	0x10

/* duplicate resolved by name mangling -- prepend CAN4TXIDR1 */
#define CAN4TXIDR1_ID18	0x20

/* duplicate resolved by name mangling -- prepend CAN4TXIDR1 */
#define CAN4TXIDR1_ID19	0x40

/* duplicate resolved by name mangling -- prepend CAN4TXIDR1 */
#define CAN4TXIDR1_ID20	0x80

/* duplicate resolved by name mangling -- prepend CAN4TXIDR1 */
#define CAN4TXIDR1_ID_15	0x7

/* duplicate resolved by name mangling -- prepend CAN4TXIDR1 */
#define CAN4TXIDR1_ID_18	0xe0

#define CAN4TXIDR2	(*(volatile unsigned char *)(REG_BASE + 0x000002B2))

/* duplicate resolved by name mangling -- prepend CAN4TXIDR2 */

#define CAN4TXIDR2_ID7	0x1

/* duplicate resolved by name mangling -- prepend CAN4TXIDR2 */
#define CAN4TXIDR2_ID8	0x2

/* duplicate resolved by name mangling -- prepend CAN4TXIDR2 */
#define CAN4TXIDR2_ID9	0x4

/* duplicate resolved by name mangling -- prepend CAN4TXIDR2 */
#define CAN4TXIDR2_ID10	0x8

/* duplicate resolved by name mangling -- prepend CAN4TXIDR2 */
#define CAN4TXIDR2_ID11	0x10

/* duplicate resolved by name mangling -- prepend CAN4TXIDR2 */
#define CAN4TXIDR2_ID12	0x20

/* duplicate resolved by name mangling -- prepend CAN4TXIDR2 */
#define CAN4TXIDR2_ID13	0x40

/* duplicate resolved by name mangling -- prepend CAN4TXIDR2 */
#define CAN4TXIDR2_ID14	0x80

/* duplicate resolved by name mangling -- prepend CAN4TXIDR2 */
#define CAN4TXIDR2_ID_7	0xff

#define CAN4TXIDR3	(*(volatile unsigned char *)(REG_BASE + 0x000002B3))

/* duplicate resolved by name mangling -- prepend CAN4TXIDR3 */

#define CAN4TXIDR3_RTR	0x1

/* duplicate resolved by name mangling -- prepend CAN4TXIDR3 */
#define CAN4TXIDR3_ID0	0x2

/* duplicate resolved by name mangling -- prepend CAN4TXIDR3 */
#define CAN4TXIDR3_ID1	0x4

/* duplicate resolved by name mangling -- prepend CAN4TXIDR3 */
#define CAN4TXIDR3_ID2	0x8

/* duplicate resolved by name mangling -- prepend CAN4TXIDR3 */
#define CAN4TXIDR3_ID3	0x10

/* duplicate resolved by name mangling -- prepend CAN4TXIDR3 */
#define CAN4TXIDR3_ID4	0x20

/* duplicate resolved by name mangling -- prepend CAN4TXIDR3 */
#define CAN4TXIDR3_ID5	0x40

/* duplicate resolved by name mangling -- prepend CAN4TXIDR3 */
#define CAN4TXIDR3_ID6	0x80

/* duplicate resolved by name mangling -- prepend CAN4TXIDR3 */
#define CAN4TXIDR3_ID	0xfe

#define CAN4TXDSR0	(*(volatile unsigned char *)(REG_BASE + 0x000002B4))

/* duplicate resolved by name mangling -- prepend CAN4TXDSR0 */

#define CAN4TXDSR0_DB0	0x1

/* duplicate resolved by name mangling -- prepend CAN4TXDSR0 */
#define CAN4TXDSR0_DB1	0x2

/* duplicate resolved by name mangling -- prepend CAN4TXDSR0 */
#define CAN4TXDSR0_DB2	0x4

/* duplicate resolved by name mangling -- prepend CAN4TXDSR0 */
#define CAN4TXDSR0_DB3	0x8

/* duplicate resolved by name mangling -- prepend CAN4TXDSR0 */
#define CAN4TXDSR0_DB4	0x10

/* duplicate resolved by name mangling -- prepend CAN4TXDSR0 */
#define CAN4TXDSR0_DB5	0x20

/* duplicate resolved by name mangling -- prepend CAN4TXDSR0 */
#define CAN4TXDSR0_DB6	0x40

/* duplicate resolved by name mangling -- prepend CAN4TXDSR0 */
#define CAN4TXDSR0_DB7	0x80

/* duplicate resolved by name mangling -- prepend CAN4TXDSR0 */
#define CAN4TXDSR0_DB	0xff

#define CAN4TXDSR1	(*(volatile unsigned char *)(REG_BASE + 0x000002B5))

/* duplicate resolved by name mangling -- prepend CAN4TXDSR1 */

#define CAN4TXDSR1_DB0	0x1

/* duplicate resolved by name mangling -- prepend CAN4TXDSR1 */
#define CAN4TXDSR1_DB1	0x2

/* duplicate resolved by name mangling -- prepend CAN4TXDSR1 */
#define CAN4TXDSR1_DB2	0x4

/* duplicate resolved by name mangling -- prepend CAN4TXDSR1 */
#define CAN4TXDSR1_DB3	0x8

/* duplicate resolved by name mangling -- prepend CAN4TXDSR1 */
#define CAN4TXDSR1_DB4	0x10

/* duplicate resolved by name mangling -- prepend CAN4TXDSR1 */
#define CAN4TXDSR1_DB5	0x20

/* duplicate resolved by name mangling -- prepend CAN4TXDSR1 */
#define CAN4TXDSR1_DB6	0x40

/* duplicate resolved by name mangling -- prepend CAN4TXDSR1 */
#define CAN4TXDSR1_DB7	0x80

/* duplicate resolved by name mangling -- prepend CAN4TXDSR1 */
#define CAN4TXDSR1_DB	0xff

#define CAN4TXDSR2	(*(volatile unsigned char *)(REG_BASE + 0x000002B6))

/* duplicate resolved by name mangling -- prepend CAN4TXDSR2 */

#define CAN4TXDSR2_DB0	0x1

/* duplicate resolved by name mangling -- prepend CAN4TXDSR2 */
#define CAN4TXDSR2_DB1	0x2

/* duplicate resolved by name mangling -- prepend CAN4TXDSR2 */
#define CAN4TXDSR2_DB2	0x4

/* duplicate resolved by name mangling -- prepend CAN4TXDSR2 */
#define CAN4TXDSR2_DB3	0x8

/* duplicate resolved by name mangling -- prepend CAN4TXDSR2 */
#define CAN4TXDSR2_DB4	0x10

/* duplicate resolved by name mangling -- prepend CAN4TXDSR2 */
#define CAN4TXDSR2_DB5	0x20

/* duplicate resolved by name mangling -- prepend CAN4TXDSR2 */
#define CAN4TXDSR2_DB6	0x40

/* duplicate resolved by name mangling -- prepend CAN4TXDSR2 */
#define CAN4TXDSR2_DB7	0x80

/* duplicate resolved by name mangling -- prepend CAN4TXDSR2 */
#define CAN4TXDSR2_DB	0xff

#define CAN4TXDSR3	(*(volatile unsigned char *)(REG_BASE + 0x000002B7))

/* duplicate resolved by name mangling -- prepend CAN4TXDSR3 */

