dldavis007/dg128_gcc_motion/Embedded/Include/mc9s12dg128_imagecraft_reference.h
#define CAN4TXDSR3_DB0	0x1

/* duplicate resolved by name mangling -- prepend CAN4TXDSR3 */
#define CAN4TXDSR3_DB1	0x2

/* duplicate resolved by name mangling -- prepend CAN4TXDSR3 */
#define CAN4TXDSR3_DB2	0x4

/* duplicate resolved by name mangling -- prepend CAN4TXDSR3 */
#define CAN4TXDSR3_DB3	0x8

/* duplicate resolved by name mangling -- prepend CAN4TXDSR3 */
#define CAN4TXDSR3_DB4	0x10

/* duplicate resolved by name mangling -- prepend CAN4TXDSR3 */
#define CAN4TXDSR3_DB5	0x20

/* duplicate resolved by name mangling -- prepend CAN4TXDSR3 */
#define CAN4TXDSR3_DB6	0x40

/* duplicate resolved by name mangling -- prepend CAN4TXDSR3 */
#define CAN4TXDSR3_DB7	0x80

/* duplicate resolved by name mangling -- prepend CAN4TXDSR3 */
#define CAN4TXDSR3_DB	0xff

#define CAN4TXDSR4	(*(volatile unsigned char *)(REG_BASE + 0x000002B8))

/* duplicate resolved by name mangling -- prepend CAN4TXDSR4 */

#define CAN4TXDSR4_DB0	0x1

/* duplicate resolved by name mangling -- prepend CAN4TXDSR4 */
#define CAN4TXDSR4_DB1	0x2

/* duplicate resolved by name mangling -- prepend CAN4TXDSR4 */
#define CAN4TXDSR4_DB2	0x4

/* duplicate resolved by name mangling -- prepend CAN4TXDSR4 */
#define CAN4TXDSR4_DB3	0x8

/* duplicate resolved by name mangling -- prepend CAN4TXDSR4 */
#define CAN4TXDSR4_DB4	0x10

/* duplicate resolved by name mangling -- prepend CAN4TXDSR4 */
#define CAN4TXDSR4_DB5	0x20

/* duplicate resolved by name mangling -- prepend CAN4TXDSR4 */
#define CAN4TXDSR4_DB6	0x40

/* duplicate resolved by name mangling -- prepend CAN4TXDSR4 */
#define CAN4TXDSR4_DB7	0x80

/* duplicate resolved by name mangling -- prepend CAN4TXDSR4 */
#define CAN4TXDSR4_DB	0xff

#define CAN4TXDSR5	(*(volatile unsigned char *)(REG_BASE + 0x000002B9))

/* duplicate resolved by name mangling -- prepend CAN4TXDSR5 */

#define CAN4TXDSR5_DB0	0x1

/* duplicate resolved by name mangling -- prepend CAN4TXDSR5 */
#define CAN4TXDSR5_DB1	0x2

/* duplicate resolved by name mangling -- prepend CAN4TXDSR5 */
#define CAN4TXDSR5_DB2	0x4

/* duplicate resolved by name mangling -- prepend CAN4TXDSR5 */
#define CAN4TXDSR5_DB3	0x8

/* duplicate resolved by name mangling -- prepend CAN4TXDSR5 */
#define CAN4TXDSR5_DB4	0x10

/* duplicate resolved by name mangling -- prepend CAN4TXDSR5 */
#define CAN4TXDSR5_DB5	0x20

/* duplicate resolved by name mangling -- prepend CAN4TXDSR5 */
#define CAN4TXDSR5_DB6	0x40

/* duplicate resolved by name mangling -- prepend CAN4TXDSR5 */
#define CAN4TXDSR5_DB7	0x80

/* duplicate resolved by name mangling -- prepend CAN4TXDSR5 */
#define CAN4TXDSR5_DB	0xff

#define CAN4TXDSR6	(*(volatile unsigned char *)(REG_BASE + 0x000002BA))

/* duplicate resolved by name mangling -- prepend CAN4TXDSR6 */

#define CAN4TXDSR6_DB0	0x1

/* duplicate resolved by name mangling -- prepend CAN4TXDSR6 */
#define CAN4TXDSR6_DB1	0x2

/* duplicate resolved by name mangling -- prepend CAN4TXDSR6 */
#define CAN4TXDSR6_DB2	0x4

/* duplicate resolved by name mangling -- prepend CAN4TXDSR6 */
#define CAN4TXDSR6_DB3	0x8

/* duplicate resolved by name mangling -- prepend CAN4TXDSR6 */
#define CAN4TXDSR6_DB4	0x10

/* duplicate resolved by name mangling -- prepend CAN4TXDSR6 */
#define CAN4TXDSR6_DB5	0x20

/* duplicate resolved by name mangling -- prepend CAN4TXDSR6 */
#define CAN4TXDSR6_DB6	0x40

/* duplicate resolved by name mangling -- prepend CAN4TXDSR6 */
#define CAN4TXDSR6_DB7	0x80

/* duplicate resolved by name mangling -- prepend CAN4TXDSR6 */
#define CAN4TXDSR6_DB	0xff

#define CAN4TXDSR7	(*(volatile unsigned char *)(REG_BASE + 0x000002BB))

/* duplicate resolved by name mangling -- prepend CAN4TXDSR7 */

#define CAN4TXDSR7_DB0	0x1

/* duplicate resolved by name mangling -- prepend CAN4TXDSR7 */
#define CAN4TXDSR7_DB1	0x2

/* duplicate resolved by name mangling -- prepend CAN4TXDSR7 */
#define CAN4TXDSR7_DB2	0x4

/* duplicate resolved by name mangling -- prepend CAN4TXDSR7 */
#define CAN4TXDSR7_DB3	0x8

/* duplicate resolved by name mangling -- prepend CAN4TXDSR7 */
#define CAN4TXDSR7_DB4	0x10

/* duplicate resolved by name mangling -- prepend CAN4TXDSR7 */
#define CAN4TXDSR7_DB5	0x20

/* duplicate resolved by name mangling -- prepend CAN4TXDSR7 */
#define CAN4TXDSR7_DB6	0x40

/* duplicate resolved by name mangling -- prepend CAN4TXDSR7 */
#define CAN4TXDSR7_DB7	0x80

/* duplicate resolved by name mangling -- prepend CAN4TXDSR7 */
#define CAN4TXDSR7_DB	0xff

#define CAN4TXDLR	(*(volatile unsigned char *)(REG_BASE + 0x000002BC))

/* duplicate resolved by name mangling -- prepend CAN4TXDLR */

#define CAN4TXDLR_DLC0	0x1

/* duplicate resolved by name mangling -- prepend CAN4TXDLR */
#define CAN4TXDLR_DLC1	0x2

/* duplicate resolved by name mangling -- prepend CAN4TXDLR */
#define CAN4TXDLR_DLC2	0x4

/* duplicate resolved by name mangling -- prepend CAN4TXDLR */
#define CAN4TXDLR_DLC3	0x8

/* duplicate resolved by name mangling -- prepend CAN4TXDLR */
#define CAN4TXDLR_DLC	0xf

#define CAN4TXTBPR	(*(volatile unsigned char *)(REG_BASE + 0x000002BF))

/* duplicate resolved by name mangling -- prepend CAN4TXTBPR */

#define CAN4TXTBPR_PRIO0	0x1

/* duplicate resolved by name mangling -- prepend CAN4TXTBPR */
#define CAN4TXTBPR_PRIO1	0x2

/* duplicate resolved by name mangling -- prepend CAN4TXTBPR */
#define CAN4TXTBPR_PRIO2	0x4

/* duplicate resolved by name mangling -- prepend CAN4TXTBPR */
#define CAN4TXTBPR_PRIO3	0x8

/* duplicate resolved by name mangling -- prepend CAN4TXTBPR */
#define CAN4TXTBPR_PRIO4	0x10

/* duplicate resolved by name mangling -- prepend CAN4TXTBPR */
#define CAN4TXTBPR_PRIO5	0x20

/* duplicate resolved by name mangling -- prepend CAN4TXTBPR */
#define CAN4TXTBPR_PRIO6	0x40

/* duplicate resolved by name mangling -- prepend CAN4TXTBPR */
#define CAN4TXTBPR_PRIO7	0x80

/* duplicate resolved by name mangling -- prepend CAN4TXTBPR */
#define CAN4TXTBPR_PRIO	0xff
#define UNSEC     	0x2
#define CLKSW     	0x4
#define TRACE     	0x8
#define SDV       	0x10
#define ENTAG     	0x20
#define BDMACT    	0x40
#define ENBDM     	0x80
#define CCR0      	0x1
#define CCR1      	0x2
#define CCR2      	0x4
#define CCR3      	0x8
#define CCR4      	0x10
#define CCR5      	0x20
#define CCR6      	0x40
#define CCR7      	0x80
#define CCR       	0xff

/* duplicate resolved by name mangling -- prepend BDMINR */
#define BDMINR_REG11	0x8

/* duplicate resolved by name mangling -- prepend BDMINR */
#define BDMINR_REG12	0x10

/* duplicate resolved by name mangling -- prepend BDMINR */
#define BDMINR_REG13	0x20

/* duplicate resolved by name mangling -- prepend BDMINR */
#define BDMINR_REG14	0x40
#define REG15     	0x80

/* duplicate resolved by name mangling -- prepend BDMINR */
#define BDMINR_REG_11	0xf8

#endif
